[
  {
    "id": 1,
    "term": "CSR",
    "meaning": "企業が利益だけでなく社会への責任も考えて行動する考え方",
    "detail": "① 説明：\nCSRは企業の社会的責任を表す考え方。\n企業が社会の一員として、環境や地域、働く人への配慮も含めて行動することを指す。\n\n② 仕組みや特徴：\nCSRでは法令遵守、環境保護、地域貢献、労働環境の改善などを企業活動として継続的に行う。\n企業が信頼を得て長く活動するための土台になる。\n\n③ 身近な例え：\nクラスでテストの点だけでなく、当番や掃除もちゃんとやる人みたいなもの。\n周りに良い影響を出す行動が信頼につながるイメージ。\n\n④ 試験のポイント：\n1）CSRは「社会的責任」を企業活動に組み込む考え方として頻出。\n2）利益追求だけを目的とする考え方と混同しやすい。\n講師の一言：儲けだけやなく、社会への責任もセットで押さえよ！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY"
  },
  {
    "id": 2,
    "term": "コンプライアンス",
    "meaning": "企業が法律やルールを守って活動すること",
    "detail": "① 説明：\nコンプライアンスは法令遵守を意味し、企業が法律や社内規則、社会のルールを守る姿勢を指す。\n不正や隠ぺいをしないことが中心になる。\n\n② 仕組みや特徴：\n企業は就業規則や情報管理ルールなどを整え、研修やチェックで守れているかを確認する。\n違反が起きると信用を失い、罰則や損害賠償などの大きな損失につながる。\n\n③ 身近な例え：\n部活で決めたルールを全員が守るのと同じ。\n一人でも破るとチーム全体の信頼が下がるイメージ。\n\n④ 試験のポイント：\n1）コンプライアンスは法令遵守の基本用語として頻出。\n2）CSRは社会への配慮まで含む点で範囲が広く、混同しやすい。\n講師の一言：まずルール守る、ここ外したら全部しんどいで！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY"
  },
  {
    "id": 3,
    "term": "ステークホルダー",
    "meaning": "企業活動によって利益や影響を受ける利害関係者",
    "detail": "① 説明：\nステークホルダーは企業に関わり、企業活動の結果として得をしたり困ったりする立場の人や組織を指す。\n株主、顧客、従業員、取引先、地域社会などが含まれる。\n\n② 仕組みや特徴：\n企業はステークホルダーごとに期待や要求が違うことを前提に、意思決定や説明を行う。\n一部だけを優先すると、反発や信頼低下が起きやすい。\n\n③ 身近な例え：\n文化祭の出し物を決めるとき、クラスだけでなく先生や来場者のことも考える感じ。\n関係者が多いほど配慮が必要になるイメージ。\n\n④ 試験のポイント：\n1）ステークホルダーは企業を取り巻く利害関係者として頻出。\n2）株主はステークホルダーの一部であり、同義ではない点で混同しやすい。\n講師の一言：誰に影響が出るか整理して考えるんがコツや！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY"
  },
  {
    "id": 4,
    "term": "知的財産権",
    "meaning": "人が考え出したアイデアや作品を法律で守るための権利",
    "detail": "① 説明：\n知的財産権は、発明やデザイン、文章や音楽などの知的な成果を保護するための権利。\n他人に勝手に使われないようにし、正しく評価されることを目的とする。\n\n② 仕組みや特徴：\n知的財産権には、特許権や著作権など複数の種類がある。\nそれぞれ守る対象や保護期間が法律で決められている。\n\n③ 身近な例え：\n自分で考えたオリジナルのノートまとめを、他人に無断でコピーされないようにする感じ。\n頑張って作ったものを守る仕組みのイメージ。\n\n④ 試験のポイント：\n1）知的財産権はアイデアや作品を守る権利の総称として頻出。\n2）特許権や著作権は知的財産権の一部である点を混同しやすい。\n講師の一言：まとめて知的財産権、その中身を分けて覚えたら楽やで！",
    "categoryId": "STRATEGY.LEGAL"
  },
  {
    "id": 5,
    "term": "著作権",
    "meaning": "文章や音楽などの作品を作った人の権利を守る法律上の仕組み",
    "detail": "① 説明：\n著作権は、文章、写真、音楽、プログラムなどの作品を作成した人に与えられる権利。\n無断でコピーや公開をされないように保護する。\n\n② 仕組みや特徴：\n著作権は作品を作った時点で自動的に発生し、申請は不要。\n作者の死後も一定期間、権利が保護される。\n\n③ 身近な例え：\n自分が描いたイラストを、許可なくSNSに勝手に投稿されないようにする感じ。\n作った人の気持ちを守るイメージ。\n\n④ 試験のポイント：\n1）著作権は創作した時点で発生する点が頻出。\n2）特許権は発明を守る権利であり、対象が違う点で混同しやすい。\n講師の一言：申請いらん、作った瞬間発生、ここが超大事や！",
    "categoryId": "STRATEGY.LEGAL"
  },
  {
    "id": 6,
    "term": "個人情報保護法",
    "meaning": "個人の情報を正しく取り扱うために定められた法律",
    "detail": "① 説明：\n個人情報保護法は、氏名や住所などの個人情報を適切に管理し、勝手に使われないようにするための法律。\n企業や組織が守るべきルールを定めている。\n\n② 仕組みや特徴：\n個人情報は利用目的を明確にし、その範囲内でのみ使用する。\n漏えいや不正利用を防ぐための安全管理が求められる。\n\n③ 身近な例え：\n友達の電話番号を、本人に断りなく他人に教えないのと同じ。\n情報を預かる側の責任を意識するイメージ。\n\n④ 試験のポイント：\n1）個人情報は適切に管理し、目的外利用をしない点が頻出。\n2）個人情報と統計データは扱いが異なる点で混同しやすい。\n講師の一言：人の情報は借りもんや思って扱いよ！",
    "categoryId": "STRATEGY.LEGAL"
  },
  {
    "id": 7,
    "term": "SWOT分析",
    "meaning": "企業の強みや弱みと外部環境を整理して戦略を考える手法",
    "detail": "① 説明：\nSWOT分析は、企業の内部要因と外部要因を整理し、経営戦略を立てるための分析方法。\n強みと弱みは企業の内部、機会と脅威は企業の外部環境を表す。\n\n② 仕組みや特徴：\nStrengthは強み、Weaknessは弱み、Opportunityは機会、Threatは脅威を意味する。\n4つの視点で整理することで、取るべき戦略が見えやすくなる。\n\n③ 身近な例え：\n部活の試合前に、自分の得意技と苦手な点、相手の弱点や強さを整理する感じ。\n勝つための作戦を考えるイメージ。\n\n④ 試験のポイント：\n1）SWOTは強み・弱み・機会・脅威の4要素で構成される点が頻出。\n2）内部要因と外部要因の区別を混同しやすい。\n講師の一言：中と外を分けて整理するんがSWOTの基本や！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY"
  },
  {
    "id": 8,
    "term": "PPM",
    "meaning": "事業を成長性と市場占有率で分類して経営資源の配分を考える手法",
    "detail": "① 説明：\nPPMはプロダクトポートフォリオマネジメントの略で、複数の事業を整理するための分析手法。\nどの事業に力を入れるか判断する目的で使われる。\n\n② 仕組みや特徴：\n市場成長率と市場占有率の2軸で事業を4つの区分に分ける。\n成長が期待できる事業と、見直す事業を整理できる点が特徴。\n\n③ 身近な例え：\nお小遣いを、伸びそうな趣味とあまり使っていないものに分けて使い道を考える感じ。\n限られたお金をどこに使うか決めるイメージ。\n\n④ 試験のポイント：\n1）PPMは事業を4つの区分で整理する分析手法として頻出。\n2）個々の製品評価ではなく事業全体を見る点を混同しやすい。\n講師の一言：どこに力入れるか決める道具や思たら分かりやすいで！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY"
  },
  {
    "id": 9,
    "term": "バリューチェーン",
    "meaning": "企業活動を価値を生み出す流れとして整理する考え方",
    "detail": "① 説明：\nバリューチェーンは、企業の活動を工程ごとに分けて、どこで価値が生まれているかを分析する考え方。\n競争力の源泉を見つける目的で使われる。\n\n② 仕組みや特徴：\n購買、製造、販売、サービスなどの主活動と、それを支える支援活動に分けて考える。\nそれぞれの活動が連なって価値を生み出す点が特徴。\n\n③ 身近な例え：\nお弁当作りで、材料を買う、調理する、盛り付けるまでの流れを一つずつ考える感じ。\nどこが一番大事かを見るイメージ。\n\n④ 試験のポイント：\n1）バリューチェーンは企業活動を価値の連鎖として捉える点が頻出。\n2）単なる業務一覧ではない点を混同しやすい。\n講師の一言：どこで価値生んでるかを見るんが肝やで！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY"
  },
  {
    "id": 10,
    "term": "技術ロードマップ",
    "meaning": "将来に向けてどの技術をいつ開発・導入するかを時系列で整理した計画",
    "detail": "① 説明：\n技術ロードマップは、企業が目指す製品やサービスに対して、必要な技術を時間の流れで整理した計画。\n中長期的な技術開発の方向性を明確にする目的で使われる。\n\n② 仕組みや特徴：\n現在の技術水準から将来必要になる技術までを段階的に並べて示す。\n研究開発や投資の優先順位を決めやすくなる点が特徴。\n\n③ 身近な例え：\n大学受験までの勉強計画を作り、今は基礎、次は応用と順番に進める感じ。\nゴールから逆算するイメージ。\n\n④ 試験のポイント：\n1）技術ロードマップは技術開発を時系列で整理する点が頻出。\n2）単なるスケジュール表ではなく、技術の方向性を示す点を混同しやすい。\n講師の一言：先のゴール決めて、技術を並べるんがロードマップや！",
    "categoryId": "STRATEGY.TECH_STRATEGY"
  },
  {
    "id": 11,
    "term": "技術ポートフォリオ",
    "meaning": "複数の技術を位置づけて整理し、投資の判断に使う考え方",
    "detail": "① 説明：\n技術ポートフォリオは、企業が持つ技術を重要度や将来性などの視点で整理する考え方。\nどの技術を強化するか判断するために使われる。\n\n② 仕組みや特徴：\n技術を複数の区分に分け、成長が期待できるものや維持すべきものを見分ける。\n限られた開発資源を効率よく配分できる点が特徴。\n\n③ 身近な例え：\n部活で、得意技・伸ばしたい技・今は使わない技を分けて練習する感じ。\n全部を同じ力でやらないイメージ。\n\n④ 試験のポイント：\n1）技術ポートフォリオは技術を整理し投資判断に使う点が頻出。\n2）事業を整理するPPMと対象が違う点で混同しやすい。\n講師の一言：事業やなく技術を並べて考えるんがポイントや！",
    "categoryId": "STRATEGY.TECH_STRATEGY"
  },
  {
    "id": 12,
    "term": "標準化戦略",
    "meaning": "技術や仕様を標準として広め、競争力を高めるための戦略",
    "detail": "① 説明：\n標準化戦略は、自社の技術や仕様を業界の標準として採用してもらうことを目指す戦略。\n市場で有利な立場を確保する目的がある。\n\n② 仕組みや特徴：\n多くの企業が同じ規格を使うことで互換性が高まり、その技術が広く普及する。\n標準を握ることで、長期的な優位性を持ちやすい。\n\n③ 身近な例え：\nみんなが同じ充電ケーブルを使うと便利になる感じ。\n自分の方式が基準になるイメージ。\n\n④ 試験のポイント：\n1）標準化戦略は技術を業界標準にする狙いとして頻出。\n2）独自技術で囲い込む戦略と対比して問われやすい。\n講師の一言：標準取れたら強い、ここは戦略として覚えとき！",
    "categoryId": "STRATEGY.TECH_STRATEGY"
  },
  {
    "id": 13,
    "term": "B2B",
    "meaning": "企業同士で商品やサービスを取引するビジネスの形態",
    "detail": "① 説明：\nB2BはBusiness to Businessの略で、企業が企業に対して商品やサービスを提供する取引形態。\n製造業やシステム開発、卸売などで多く見られる。\n\n② 仕組みや特徴：\n取引金額が大きく、契約内容や条件を細かく決めて進めることが多い。\n長期的な取引関係になりやすい点が特徴。\n\n③ 身近な例え：\n文房具屋が学校にまとめてノートを納品するような関係。\n個人ではなく組織同士のやり取りのイメージ。\n\n④ 試験のポイント：\n1）B2Bは企業間取引を表す基本用語として頻出。\n2）個人向けのB2Cとの違いで混同しやすい。\n講師の一言：相手が会社か個人か、まずそこ見分けたらええ！",
    "categoryId": "STRATEGY.BUSINESS_INDUSTRY"
  },
  {
    "id": 14,
    "term": "B2C",
    "meaning": "企業が個人の消費者に商品やサービスを提供するビジネスの形態",
    "detail": "① 説明：\nB2CはBusiness to Consumerの略で、企業が一般の消費者を相手に行う取引形態。\n小売業やネット通販などが代表例。\n\n② 仕組みや特徴：\n不特定多数の消費者を対象にするため、価格や使いやすさ、宣伝が重要になる。\n取引は比較的短期間で完結することが多い。\n\n③ 身近な例え：\nコンビニでお菓子を買うような関係。\nお店とお客さんのやり取りのイメージ。\n\n④ 試験のポイント：\n1）B2Cは企業から消費者への取引を表す用語として頻出。\n2）企業向けのB2Bとの違いを整理して覚える必要がある。\n講師の一言：お客さんが一般の人かどうか、そこが判断ポイントや！",
    "categoryId": "STRATEGY.BUSINESS_INDUSTRY"
  },
  {
    "id": 15,
    "term": "シェアリングエコノミー",
    "meaning": "使っていない資産を他人と共有して活用するビジネスの仕組み",
    "detail": "① 説明：\nシェアリングエコノミーは、個人が持つモノやサービスを他の人と共有することで成り立つビジネス。\nインターネットを通じて取引が行われる。\n\n② 仕組みや特徴：\n空いている時間や物を必要な人に提供し、双方に利益が生まれる。\n仲介するサービス事業者が取引を支える点が特徴。\n\n③ 身近な例え：\n使っていない自転車を、必要な人に貸して使ってもらう感じ。\nみんなで無駄なく使うイメージ。\n\n④ 試験のポイント：\n1）シェアリングエコノミーは共有を前提とした新しいビジネス形態として頻出。\n2）単なるレンタルサービスとの違いで混同しやすい。\n講師の一言：自分の使ってへんもんを活かす発想やで！",
    "categoryId": "STRATEGY.BUSINESS_INDUSTRY"
  },
  {
    "id": 16,
    "term": "情報システム戦略",
    "meaning": "経営目標を達成するために情報システムをどう活用するかを定める方針",
    "detail": "① 説明：\n情報システム戦略は、企業の経営戦略を支えるために、情報システムをどのように整備・活用するかを決める考え方。\n経営とITを結びつける役割を持つ。\n\n② 仕組みや特徴：\n業務効率化や競争力向上などの目的に合わせて、導入するシステムや優先順位を決める。\n部分最適ではなく、企業全体を見て考える点が特徴。\n\n③ 身近な例え：\nクラス全体の成績を上げるために、どの教科に時間をかけるか計画を立てる感じ。\n目標から逆算するイメージ。\n\n④ 試験のポイント：\n1）情報システム戦略は経営戦略と連動して立てる点が頻出。\n2）単なるシステム導入計画と混同しやすい。\n講師の一言：ITは手段、目的は経営やって意識しよ！",
    "categoryId": "STRATEGY.SYSTEM_STRATEGY"
  },
  {
    "id": 17,
    "term": "IT投資",
    "meaning": "業務改善や利益向上を目的として情報システムにお金を使うこと",
    "detail": "① 説明：\nIT投資は、システム導入や更新にかかる費用を、将来の効果を見込んで支出すること。\n単なるコストではなく投資として考える。\n\n② 仕組みや特徴：\n初期費用や運用費用に対して、業務効率化や売上向上などの効果を評価する。\n費用対効果を意識する点が重要。\n\n③ 身近な例え：\n勉強効率を上げるために参考書を買う感じ。\n今お金を使って、あとで成果を得るイメージ。\n\n④ 試験のポイント：\n1）IT投資は効果とコストを比較して判断する点が頻出。\n2）単なる経費処理と混同しやすい。\n講師の一言：払う理由と得られる効果、そこセットで考えよ！",
    "categoryId": "STRATEGY.SYSTEM_STRATEGY"
  },
  {
    "id": 18,
    "term": "全体最適",
    "meaning": "組織全体として最も良い結果になるように考えること",
    "detail": "① 説明：\n全体最適は、一部の部署や業務だけでなく、企業全体の利益や効率を重視する考え方。\n情報システム戦略では特に重要になる。\n\n② 仕組みや特徴：\n部門ごとに最適化すると、全体では無駄や非効率が生まれることがある。\n全体を見渡して調整する点が特徴。\n\n③ 身近な例え：\nクラスで一人だけ楽をするより、全員が協力して準備を進める感じ。\n結果として全体がうまく回るイメージ。\n\n④ 試験のポイント：\n1）全体最適はシステム戦略の基本的な考え方として頻出。\n2）部分最適との対比で問われやすい。\n講師の一言：一部だけ良くしても、全体あかんかったら意味ないで！",
    "categoryId": "STRATEGY.SYSTEM_STRATEGY"
  },
  {
    "id": 19,
    "term": "RFP",
    "meaning": "システム開発を依頼するために要求内容をまとめた文書",
    "detail": "① 説明：\nRFPはRequest for Proposalの略で、発注側がシステム開発会社に対して要望や条件を伝えるための文書。\nどんな目的で、何を実現したいかを明確にする役割を持つ。\n\n② 仕組みや特徴：\n業務内容、必要な機能、予算や納期などを整理して提示する。\nこれをもとに開発会社は提案書を作成する。\n\n③ 身近な例え：\n文化祭で出し物を業者に頼むときに、内容や予算を書いた依頼書を渡す感じ。\n要望をはっきり伝えるイメージ。\n\n④ 試験のポイント：\n1）RFPは発注側が作成する要求文書として頻出。\n2）提案書は受注側が作る点と混同しやすい。\n講師の一言：頼む側が書くんがRFP、ここ間違えたらあかんで！",
    "categoryId": "STRATEGY.SYSTEM_PLANNING"
  },
  {
    "id": 20,
    "term": "要件定義",
    "meaning": "システムに必要な機能や条件を明確にする工程",
    "detail": "① 説明：\n要件定義は、利用者や業務の要望を整理し、システムに必要な機能や性能を決める工程。\nシステム企画の中でも特に重要な段階。\n\n② 仕組みや特徴：\n業務要件や機能要件を文書にまとめ、関係者で合意を取る。\nここが曖昧だと後工程で手戻りが起きやすい。\n\n③ 身近な例え：\n家を建てる前に、部屋の数や広さを決めて設計図を作る感じ。\n最初のすり合わせのイメージ。\n\n④ 試験のポイント：\n1）要件定義はシステム開発前に行う重要工程として頻出。\n2）設計工程との役割の違いで混同しやすい。\n講師の一言：最初にちゃんと決める、これが後で効いてくるんや！",
    "categoryId": "STRATEGY.SYSTEM_PLANNING"
  },
  {
    "id": 21,
    "term": "システム化計画",
    "meaning": "業務をどのようにシステムで実現するかをまとめた計画",
    "detail": "① 説明：\nシステム化計画は、業務の課題を整理し、どの部分をシステム化するかを決める計画。\nシステム企画の初期段階で作成される。\n\n② 仕組みや特徴：\n対象業務、期待される効果、導入スケジュールなどをまとめる。\n経営方針との整合性を意識する点が特徴。\n\n③ 身近な例え：\n勉強の弱点を洗い出して、どの教科を重点的に対策するか決める感じ。\n全体計画を立てるイメージ。\n\n④ 試験のポイント：\n1）システム化計画は業務とITを結びつける計画として頻出。\n2）具体的な設計作業ではない点で混同しやすい。\n講師の一言：まず全体の作戦立ててから動くんが基本やで！",
    "categoryId": "STRATEGY.SYSTEM_PLANNING"
  },
  {
    "id": 22,
    "term": "ウォーターフォールモデル",
    "meaning": "工程を上から順番に進めていくシステム開発の進め方",
    "detail": "① 説明：\nウォーターフォールモデルは、要件定義から設計、開発、テスト、運用へと工程を順に進める開発手法。\n前の工程が完了してから次へ進む流れが基本になる。\n\n② 仕組みや特徴：\n各工程の成果物を確認しながら進めるため、計画が立てやすい。\n後工程での変更が難しい点が特徴。\n\n③ 身近な例え：\n家を建てるときに、設計図を決めてから工事を始める流れと同じ。\n順番を戻せないイメージ。\n\n④ 試験のポイント：\n1）工程を順番に進める開発手法として頻出。\n2）途中で仕様変更しにくい点でアジャイル開発と混同しやすい。\n講師の一言：上から順に流れる、名前通りやと覚えたらええ！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH"
  },
  {
    "id": 23,
    "term": "アジャイル開発",
    "meaning": "短い期間で開発と見直しを繰り返すシステム開発の進め方",
    "detail": "① 説明：\nアジャイル開発は、機能ごとに小さく作って確認しながら進める開発手法。\n利用者の意見を反映しやすい点が特徴。\n\n② 仕組みや特徴：\n短い開発期間を何度も繰り返し、その都度改善を行う。\n変化に柔軟に対応できる。\n\n③ 身近な例え：\nテスト前に問題集を少しずつ解いて、間違いを直しながら進める勉強法。\n完成形を徐々に作るイメージ。\n\n④ 試験のポイント：\n1）短期間の開発と改善を繰り返す点が頻出。\n2）最初に全体を決めるウォーターフォールモデルと混同しやすい。\n講師の一言：作って直すを回すんがアジャイルや！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH"
  },
  {
    "id": 24,
    "term": "システムテスト",
    "meaning": "完成したシステム全体が正しく動くかを確認するテスト",
    "detail": "① 説明：\nシステムテストは、個々の機能を組み合わせたシステム全体が要件通りに動作するかを確認する工程。\n本番利用を想定して行われる。\n\n② 仕組みや特徴：\n実際の運用に近い条件でテストを行い、不具合や問題点を見つける。\n開発工程の後半で実施される。\n\n③ 身近な例え：\n自転車を組み立てた後に、実際に乗ってブレーキやライトを確認する感じ。\n全部まとめてチェックするイメージ。\n\n④ 試験のポイント：\n1）システム全体を対象にしたテスト工程として頻出。\n2）単体テストや結合テストとの違いを混同しやすい。\n講師の一言：全部つないでから動かす、それがシステムテストや！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH"
  },
  {
    "id": 25,
    "term": "進捗管理",
    "meaning": "計画に対して作業がどこまで進んでいるかを把握し調整すること",
    "detail": "① 説明：\n進捗管理は、ソフトウェア開発が予定どおり進んでいるかを確認し、遅れや問題があれば対応する活動。\nプロジェクトを計画通りに進めるために欠かせない。\n\n② 仕組みや特徴：\n作業の開始日や完了予定日を決め、実績と比較して管理する。\n遅れが出た場合は、作業分担やスケジュールを見直す。\n\n③ 身近な例え：\nテスト勉強で、今日はどこまで終わったかを確認して予定を調整する感じ。\nゴールまでの道のりをチェックするイメージ。\n\n④ 試験のポイント：\n1）進捗管理は計画と実績を比較する点が頻出。\n2）品質管理やコスト管理との役割の違いで混同しやすい。\n講師の一言：今どこまで来てるか、常に見える化するんが大事や！",
    "categoryId": "MANAGEMENT.SOFTWARE_DEV_MGMT"
  },
  {
    "id": 26,
    "term": "品質管理",
    "meaning": "ソフトウェアが決められた品質を満たしているかを管理すること",
    "detail": "① 説明：\n品質管理は、ソフトウェアが要求された性能や正しさを満たしているかを確認し維持する活動。\n不具合の発生を防ぐ目的がある。\n\n② 仕組みや特徴：\nレビューやテストを通じて問題点を早期に見つける。\n基準を決めて、それを満たしているかを確認する点が特徴。\n\n③ 身近な例え：\n提出前にレポートを読み返して、誤字や内容を確認する感じ。\n完成度をチェックするイメージ。\n\n④ 試験のポイント：\n1）品質管理は不具合防止と品質維持が目的として頻出。\n2）進捗管理やコスト管理と混同しやすい。\n講師の一言：早めにチェックするほど後が楽やで！",
    "categoryId": "MANAGEMENT.SOFTWARE_DEV_MGMT"
  },
  {
    "id": 27,
    "term": "コスト管理",
    "meaning": "予算内でソフトウェア開発を進めるために費用を管理すること",
    "detail": "① 説明：\nコスト管理は、開発にかかる費用を把握し、予算を超えないように調整する活動。\n人件費や外注費などが対象になる。\n\n② 仕組みや特徴：\n計画時の予算と実際にかかった費用を比較して管理する。\n超過しそうな場合は作業内容や体制を見直す。\n\n③ 身近な例え：\nお小遣いの範囲で欲しい物を買えるように使い道を考える感じ。\n使いすぎを防ぐイメージ。\n\n④ 試験のポイント：\n1）コスト管理は予算と実績の比較が頻出。\n2）進捗管理や品質管理と目的が違う点で混同しやすい。\n講師の一言：お金の管理も立派な技術や、軽く見たらあかん！",
    "categoryId": "MANAGEMENT.SOFTWARE_DEV_MGMT"
  },
  {
    "id": 28,
    "term": "プロジェクト",
    "meaning": "決められた目的を達成するために期間を区切って行う活動",
    "detail": "① 説明：\nプロジェクトは、明確な目的と期限を持って実施される一時的な取り組み。\nシステム開発やイベント開催などが代表例。\n\n② 仕組みや特徴：\n開始と終了が決まっており、完了すると解散する。\n人、時間、コストといった制約の中で目的達成を目指す。\n\n③ 身近な例え：\n文化祭の準備を、本番の日までに終わらせる活動と同じ。\nゴールと期限が決まっているイメージ。\n\n④ 試験のポイント：\n1）プロジェクトは一時的な活動である点が頻出。\n2）日常業務とは違い、必ず終了がある点で混同しやすい。\n講師の一言：終わりが決まってる活動、それがプロジェクトや！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT"
  },
  {
    "id": 29,
    "term": "プロジェクトマネージャ",
    "meaning": "プロジェクト全体を計画し管理する責任者",
    "detail": "① 説明：\nプロジェクトマネージャは、プロジェクトの目標達成に責任を持つ立場。\n進捗や品質、コストなどを総合的に管理する。\n\n② 仕組みや特徴：\n計画立案、メンバー調整、問題対応など幅広い役割を担う。\n関係者との連携と判断力が求められる。\n\n③ 身近な例え：\n部活のキャプテンが、練習計画や試合準備をまとめる感じ。\n全体を見て指示するイメージ。\n\n④ 試験のポイント：\n1）プロジェクトマネージャはプロジェクト全体の責任者として頻出。\n2）作業担当者とは役割が異なる点で混同しやすい。\n講師の一言：全部背負う立場、それがプロマネやで！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT"
  },
  {
    "id": 30,
    "term": "スコープ",
    "meaning": "プロジェクトで実施する作業の範囲",
    "detail": "① 説明：\nスコープは、プロジェクトで何をやって何をやらないかを明確にした範囲のこと。\n目的達成に必要な作業内容を定める。\n\n② 仕組みや特徴：\nスコープを決めることで、作業の増えすぎや認識のズレを防げる。\n途中で変更が入ると影響が大きくなる。\n\n③ 身近な例え：\nテスト勉強で、今回は英語と数学だけやると決める感じ。\n範囲をはっきりさせるイメージ。\n\n④ 試験のポイント：\n1）スコープは作業範囲を示す用語として頻出。\n2）スケジュールやコストとは別の管理対象である点を混同しやすい。\n講師の一言：どこまでやるか決めんと、仕事終わらへんで！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT"
  },
  {
    "id": 31,
    "term": "サービスデスク",
    "meaning": "利用者からの問い合わせやトラブルをまとめて受け付ける窓口",
    "detail": "① 説明：\nサービスデスクは、ITサービスに関する質問や障害の連絡を一元的に受け付ける窓口。\n利用者とIT部門をつなぐ役割を持つ。\n\n② 仕組みや特徴：\n問い合わせ内容を記録し、対応や担当部署への引き継ぎを行う。\n対応状況を管理することで、問題の見える化や再発防止につながる。\n\n③ 身近な例え：\n学校で困ったことがあったときに、まず職員室に相談しに行く感じ。\n相談先を一つにまとめるイメージ。\n\n④ 試験のポイント：\n1）サービスデスクは問い合わせや障害対応の窓口として頻出。\n2）単なる電話受付ではなく、管理機能を持つ点で混同しやすい。\n講師の一言：困ったらまずここ、入口一本化がポイントや！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT"
  },
  {
    "id": 32,
    "term": "SLA",
    "meaning": "サービスの品質や内容について提供側と利用側で合意した取り決め",
    "detail": "① 説明：\nSLAはService Level Agreementの略で、ITサービスの品質水準を文書で定めたもの。\nサービス提供の基準を明確にする目的がある。\n\n② 仕組みや特徴：\n稼働時間や対応時間などの指標を決め、守られているかを確認する。\nトラブル時の責任範囲をはっきりさせる点が特徴。\n\n③ 身近な例え：\n家庭で、門限や当番のルールを事前に決めておく感じ。\n守る約束を決めるイメージ。\n\n④ 試験のポイント：\n1）SLAはサービス品質の合意文書として頻出。\n2）内部目標との違いで混同しやすい。\n講師の一言：約束を数字で決める、それがSLAや！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT"
  },
  {
    "id": 33,
    "term": "インシデント管理",
    "meaning": "サービスの障害やトラブルに対応して早く元に戻すための管理活動",
    "detail": "① 説明：\nインシデント管理は、ITサービスに発生した障害や問題に対応し、通常の状態に戻すことを目的とした活動。\n原因究明よりも復旧を優先する。\n\n② 仕組みや特徴：\n問い合わせや障害を受け付け、影響度や緊急度を判断して対応する。\n被害を最小限に抑える点が特徴。\n\n③ 身近な例え：\n停電が起きたときに、まず電気を復旧させる対応をする感じ。\n原因調査は後回しのイメージ。\n\n④ 試験のポイント：\n1）インシデント管理は迅速な復旧が目的として頻出。\n2）原因を分析する問題管理と混同しやすい。\n講師の一言：まず直す、原因はあと、それがインシデント管理や！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT"
  },
  {
    "id": 34,
    "term": "システム監査",
    "meaning": "情報システムが適切に運用されているかを第三者の立場で評価すること",
    "detail": "① 説明：\nシステム監査は、情報システムが安全で効率的に運用されているかを、客観的な立場から確認する活動。\n企業のルールや法律に沿っているかを評価する。\n\n② 仕組みや特徴：\n監査基準に基づき、文書や運用状況を確認する。\n問題点があれば改善点として指摘される。\n\n③ 身近な例え：\n学校で先生とは別の立場の人が、授業や運営をチェックする感じ。\n中立な目で見るイメージ。\n\n④ 試験のポイント：\n1）システム監査は第三者の客観的評価である点が頻出。\n2）日常の運用管理とは役割が違う点で混同しやすい。\n講師の一言：中立な立場でチェックする、ここが監査の肝や！",
    "categoryId": "MANAGEMENT.SYSTEM_AUDIT"
  },
  {
    "id": 35,
    "term": "監査証拠",
    "meaning": "監査の判断を裏付けるために集められる資料や記録",
    "detail": "① 説明：\n監査証拠は、システム監査で評価や判断を行う際の根拠となる資料やデータ。\n記録や文書などの客観的な情報が対象になる。\n\n② 仕組みや特徴：\nログ、マニュアル、運用記録などを確認して証拠として用いる。\n証拠に基づいて監査結果がまとめられる。\n\n③ 身近な例え：\nテストの答えを説明するときに、ノートや教科書を根拠として示す感じ。\n証明に使う材料のイメージ。\n\n④ 試験のポイント：\n1）監査証拠は監査判断の根拠として頻出。\n2）個人の意見ではなく客観的資料である点を混同しやすい。\n講師の一言：感覚やなく証拠、これが監査の基本やで！",
    "categoryId": "MANAGEMENT.SYSTEM_AUDIT"
  },
  {
    "id": 36,
    "term": "内部統制",
    "meaning": "企業が業務を正しく行うために整える仕組み",
    "detail": "① 説明：\n内部統制は、業務の効率化や不正防止を目的として、企業内部で整備される仕組み。\n情報システムも重要な対象になる。\n\n② 仕組みや特徴：\nルール作り、権限分離、チェック体制などを組み合わせて運用する。\n継続的に見直される点が特徴。\n\n③ 身近な例え：\nクラスで係の役割を分けて、間違いが起きにくくする感じ。\n一人に任せきりにしないイメージ。\n\n④ 試験のポイント：\n1）内部統制は不正防止と業務の信頼性向上が目的として頻出。\n2）監査はチェックする側、内部統制は整える側である点を混同しやすい。\n講師の一言：仕組みでミス防ぐ、それが内部統制や！",
    "categoryId": "MANAGEMENT.SYSTEM_AUDIT"
  },
  {
    "id": 37,
    "term": "ビット",
    "meaning": "情報量を表す最小単位",
    "detail": "① 説明：\nビットは情報の量を表すための最も小さな単位。\nコンピュータでは情報を0か1のどちらかで表す。\n\n② 仕組みや特徴：\n1ビットは0または1のどちらかの状態を持つ。\n8ビットが集まると1バイトになり、文字や数値を表せる。\n\n③ 身近な例え：\nはいかいいえで答える質問が1つある感じ。\n選択肢が2つしかないイメージ。\n\n④ 試験のポイント：\n1）ビットは情報量の最小単位として頻出。\n2）バイトとの換算関係で混同しやすい。\n講師の一言：まずは0か1、それが全部の基本や！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY"
  },
  {
    "id": 38,
    "term": "2進数",
    "meaning": "0と1だけを使って数を表す方法",
    "detail": "① 説明：\n2進数は、コンピュータ内部で使われる数の表し方。\n電気のオンとオフを0と1で表す。\n\n② 仕組みや特徴：\n桁が上がると2倍ずつ数が増える仕組み。\n人が使う10進数とは計算方法が異なる。\n\n③ 身近な例え：\n電気のスイッチが入っているか切れているかで情報を伝える感じ。\n白か黒かだけで判断するイメージ。\n\n④ 試験のポイント：\n1）コンピュータは2進数で処理する点が頻出。\n2）10進数との変換問題で混同しやすい。\n講師の一言：機械は0と1だけで考えてる思たら分かりやすいで！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY"
  },
  {
    "id": 39,
    "term": "論理演算",
    "meaning": "条件の成り立ちを0と1で計算する考え方",
    "detail": "① 説明：\n論理演算は、条件が正しいかどうかを0と1で判断する計算方法。\nコンピュータの判断処理の基礎になる。\n\n② 仕組みや特徴：\nANDは両方が1のときに1になる演算。\nORやNOTなど、決まったルールで結果が決まる。\n\n③ 身近な例え：\n雨で傘を持っているときだけ外に出る、のような条件判断。\n条件を組み合わせて決めるイメージ。\n\n④ 試験のポイント：\n1）AND・OR・NOTの意味と結果が頻出。\n2）条件が複数ある場合の判断で混同しやすい。\n講師の一言：条件の組み合わせ、表にして考えたら楽やで！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY"
  },
  {
    "id": 40,
    "term": "アルゴリズム",
    "meaning": "問題を解決するための手順や考え方",
    "detail": "① 説明：\nアルゴリズムは、目的を達成するために行う処理の手順を順番にまとめたもの。\nコンピュータに限らず、考え方そのものを指す。\n\n② 仕組みや特徴：\n処理の順序が明確で、同じ入力に対して同じ結果が出る。\n効率の良いアルゴリズムほど、処理時間や手間が少なくなる。\n\n③ 身近な例え：\nカレーを作るときのレシピの手順と同じ。\n順番を守らないとうまくいかないイメージ。\n\n④ 試験のポイント：\n1）アルゴリズムは処理手順そのものを指す点が頻出。\n2）プログラムはアルゴリズムを実際に書いたものという違いで混同しやすい。\n講師の一言：手順が頭にあるかどうか、それがアルゴリズムや！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING"
  },
  {
    "id": 41,
    "term": "フローチャート",
    "meaning": "処理の流れを図で表したもの",
    "detail": "① 説明：\nフローチャートは、処理の順番や分岐を図記号を使って表現したもの。\nアルゴリズムを分かりやすく示す目的で使われる。\n\n② 仕組みや特徴：\n開始や終了、処理、判断などを決まった記号で表す。\n上から下、左から右へ流れを追う。\n\n③ 身近な例え：\n学校の案内図で、次にどこへ行くか矢印で示されている感じ。\n流れを目で追えるイメージ。\n\n④ 試験のポイント：\n1）判断の分岐はひし形で表す点が頻出。\n2）処理の流れと記号の意味を混同しやすい。\n講師の一言：図にすると一気に分かりやすなるで！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING"
  },
  {
    "id": 42,
    "term": "擬似言語",
    "meaning": "プログラムの処理内容を文章で表したもの",
    "detail": "① 説明：\n擬似言語は、特定のプログラミング言語を使わずに、処理の内容を文章で表現する方法。\nアルゴリズムの説明に使われる。\n\n② 仕組みや特徴：\n日本語や英単語を使って処理の流れを書く。\n文法の細かさより、処理内容の理解を重視する。\n\n③ 身近な例え：\n料理の作り方を、細かい分量は省いて文章で説明する感じ。\n流れを伝えるイメージ。\n\n④ 試験のポイント：\n1）擬似言語は処理内容を分かりやすく表すための手段として頻出。\n2）実際に動くプログラムではない点で混同しやすい。\n講師の一言：動かすためやなく、伝えるための書き方やで！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING"
  },
  {
    "id": 43,
    "term": "CPU",
    "meaning": "コンピュータ全体の処理を実行し制御する中枢となる装置",
    "detail": "① 説明：\nCPUは中央処理装置とも呼ばれ、計算や判断を行い、他の装置に指示を出す役割を持つ。\nコンピュータの頭脳にあたる存在。\n\n② 仕組みや特徴：\nCPUは命令を取り出し、解釈して実行する流れで動く。\n処理速度が速いほど、全体の動作も快適になる。\n\n③ 身近な例え：\nクラスで指示を出して全体を動かす学級委員のような役割。\n判断して行動を決めるイメージ。\n\n④ 試験のポイント：\n1）CPUは計算と制御を行う中枢装置として頻出。\n2）記憶装置と役割が違う点で混同しやすい。\n講師の一言：考えて指示出す役、それがCPUや！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS"
  },
  {
    "id": 44,
    "term": "ROM",
    "meaning": "電源を切っても内容が消えない記憶装置",
    "detail": "① 説明：\nROMは読み出し専用の記憶装置で、コンピュータを動かすための基本的な情報が保存されている。\n電源を切っても内容が残る。\n\n② 仕組みや特徴：\nROMは不揮発性メモリであり、不揮発性とは電源を切ってもデータが消えない性質のこと。\n起動時に必要なプログラムが格納されている。\n\n③ 身近な例え：\n学校の校則が書かれた冊子のようなもの。\nいつ見ても内容が変わらないイメージ。\n\n④ 試験のポイント：\n1）ROMは不揮発性である点が頻出。\n2）電源を切ると消えるRAMとの違いで混同しやすい。\n講師の一言：消えへん記憶、それがROMや！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS"
  },
  {
    "id": 45,
    "term": "補助記憶装置",
    "meaning": "データを長期間保存するための記憶装置",
    "detail": "① 説明：\n補助記憶装置は、プログラムやデータを電源を切っても保存しておくための装置。\n主記憶装置を補う役割を持つ。\n\n② 仕組みや特徴：\n不揮発性で、大容量のデータを保存できる。\nRAMより読み書きは遅いが、保存性に優れる。\n\n③ 身近な例え：\n家の本棚に教科書やノートをしまっておく感じ。\n必要なときに取り出すイメージ。\n\n④ 試験のポイント：\n1）補助記憶装置は長期保存用である点が頻出。\n2）主記憶装置との役割の違いで混同しやすい。\n講師の一言：置いとく場所が補助記憶、使う場所が主記憶や！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS"
  },
  {
    "id": 46,
    "term": "クライアントサーバシステム",
    "meaning": "処理を行う役割を分担して動くシステムの構成方式",
    "detail": "① 説明：\nクライアントサーバシステムは、要求を出す側と処理を行う側に役割を分けて動作するシステム構成。\n利用者の操作とデータ処理を分担する考え方。\n\n② 仕組みや特徴：\nクライアントが要求を送り、サーバが処理やデータ管理を行う。\n役割分担により、管理や拡張がしやすい点が特徴。\n\n③ 身近な例え：\nお店で注文を出して、厨房が料理を作る関係。\n頼む側と作る側が分かれているイメージ。\n\n④ 試験のポイント：\n1）クライアントとサーバの役割分担が頻出。\n2）すべてを一台で処理する構成との違いで混同しやすい。\n講師の一言：頼む人と処理する側、役割分担が基本や！",
    "categoryId": "TECHNOLOGY.SYSTEM_COMPONENTS"
  },
  {
    "id": 47,
    "term": "集中処理システム",
    "meaning": "処理や管理を一か所にまとめて行うシステム構成",
    "detail": "① 説明：\n集中処理システムは、データ処理や管理を中心となるコンピュータでまとめて行う方式。\n古くから使われている基本的な構成。\n\n② 仕組みや特徴：\n端末は入力や表示のみを担当し、処理は中央で行う。\n管理がしやすい反面、障害時の影響が大きい。\n\n③ 身近な例え：\nクラスの仕事を一人が全部まとめて処理する感じ。\n効率はいいが負担が集中するイメージ。\n\n④ 試験のポイント：\n1）処理を一か所で行う方式として頻出。\n2）分散処理との違いで混同しやすい。\n講師の一言：まとめて処理、名前通りやと覚えたらええ！",
    "categoryId": "TECHNOLOGY.SYSTEM_COMPONENTS"
  },
  {
    "id": 48,
    "term": "分散処理システム",
    "meaning": "複数のコンピュータで処理を分担して行うシステム構成",
    "detail": "① 説明：\n分散処理システムは、複数のコンピュータが連携して処理を行う方式。\n負荷分散や信頼性向上を目的とする。\n\n② 仕組みや特徴：\n処理を複数の装置に分けることで、一部が停止しても全体が止まりにくい。\n拡張しやすい点が特徴。\n\n③ 身近な例え：\nクラス全員で役割分担して作業を進める感じ。\n一人休んでも全体は動くイメージ。\n\n④ 試験のポイント：\n1）処理を分担する構成として頻出。\n2）集中処理システムとの対比で問われやすい。\n講師の一言：分けて処理したら強い、これが分散や！",
    "categoryId": "TECHNOLOGY.SYSTEM_COMPONENTS"
  },
  {
    "id": 49,
    "term": "OS",
    "meaning": "コンピュータ全体を管理し、ソフトウェアを動かすための基本となるソフトウェア",
    "detail": "① 説明：\nOSはオペレーティングシステムの略で、コンピュータを動かす土台となるソフトウェア。\nアプリケーションとハードウェアの仲介役をする。\n\n② 仕組みや特徴：\nCPUやメモリ、ファイルなどの資源を管理し、アプリが正しく動くよう制御する。\nOSがなければアプリは動作できない。\n\n③ 身近な例え：\n学校で時間割や校則を管理して、授業が成り立つようにする仕組み。\n全体をまとめる役割のイメージ。\n\n④ 試験のポイント：\n1）OSは基本ソフトウェアとして頻出。\n2）アプリケーションソフトウェアとの違いで混同しやすい。\n講師の一言：土台がOS、その上でアプリが動くんや！",
    "categoryId": "TECHNOLOGY.SOFTWARE"
  },
  {
    "id": 50,
    "term": "アプリケーションソフトウェア",
    "meaning": "利用者の目的に応じた処理を行うソフトウェア",
    "detail": "① 説明：\nアプリケーションソフトウェアは、文書作成や表計算など、利用者の作業を直接支援するソフトウェア。\nOSの上で動作する。\n\n② 仕組みや特徴：\n特定の目的ごとに作られており、用途に応じて使い分ける。\nOSが提供する機能を利用して動く。\n\n③ 身近な例え：\nノートや電卓、辞書などを使い分けて勉強する感じ。\n目的別の道具のイメージ。\n\n④ 試験のポイント：\n1）アプリケーションソフトウェアは利用者向けのソフトとして頻出。\n2）OSとの役割分担で混同しやすい。\n講師の一言：使う側の目的に合わせた道具や思たらええ！",
    "categoryId": "TECHNOLOGY.SOFTWARE"
  },
  {
    "id": 51,
    "term": "ミドルウェア",
    "meaning": "OSとアプリケーションの間で共通機能を提供するソフトウェア",
    "detail": "① 説明：\nミドルウェアは、OSとアプリケーションの間に入り、共通して使われる機能を提供するソフトウェア。\n開発や運用を効率化する役割を持つ。\n\n② 仕組みや特徴：\n通信処理やデータ管理などをまとめて提供する。\nアプリは細かい処理を意識せずに機能を利用できる。\n\n③ 身近な例え：\n学校で共通の連絡プリントを使って、クラスごとの説明を省く感じ。\n間に入って助けるイメージ。\n\n④ 試験のポイント：\n1）ミドルウェアはOSとアプリの中間に位置する点が頻出。\n2）アプリケーションソフトウェアとの役割の違いで混同しやすい。\n講師の一言：間に入って楽させる、それがミドルウェアや！",
    "categoryId": "TECHNOLOGY.SOFTWARE"
  },
  {
    "id": 52,
    "term": "入力装置",
    "meaning": "人がコンピュータに情報を入力するための装置",
    "detail": "① 説明：\n入力装置は、文字や操作などの情報をコンピュータに伝えるための装置。\n人とコンピュータをつなぐ役割を持つ。\n\n② 仕組みや特徴：\nキーボードやマウスなどが代表例で、操作内容を信号として送る。\n入力された情報はCPUで処理される。\n\n③ 身近な例え：\n先生に質問するときに、手を挙げて意思を伝える感じ。\nこちらの考えを伝えるイメージ。\n\n④ 試験のポイント：\n1）入力装置は情報を取り込む役割として頻出。\n2）出力装置との違いで混同しやすい。\n講師の一言：まずは入力せな始まらへん、入口の装置や！",
    "categoryId": "TECHNOLOGY.HARDWARE"
  },
  {
    "id": 53,
    "term": "出力装置",
    "meaning": "コンピュータの処理結果を人に分かる形で表示する装置",
    "detail": "① 説明：\n出力装置は、コンピュータが処理した結果を文字や画像として外に出す装置。\n人が結果を確認するために使われる。\n\n② 仕組みや特徴：\nディスプレイやプリンタなどが代表例。\n電気信号を文字や映像として表現する。\n\n③ 身近な例え：\nテストの結果が返ってきて点数を見る感じ。\n結果を受け取るイメージ。\n\n④ 試験のポイント：\n1）出力装置は処理結果を表示する役割として頻出。\n2）入力装置との区別で混同しやすい。\n講師の一言：結果を見せてくれるんが出力装置や！",
    "categoryId": "TECHNOLOGY.HARDWARE"
  },
  {
    "id": 54,
    "term": "記憶装置",
    "meaning": "データやプログラムを保存するための装置",
    "detail": "① 説明：\n記憶装置は、コンピュータが使うデータやプログラムを保存する装置の総称。\n一時保存と長期保存の両方が含まれる。\n\n② 仕組みや特徴：\n主記憶装置と補助記憶装置に分かれる。\n主記憶装置は高速だが電源を切ると消え、補助記憶装置は長期保存ができる。\n\n③ 身近な例え：\n机の上のノートと、本棚の教科書を使い分ける感じ。\nすぐ使うものと保管するもののイメージ。\n\n④ 試験のポイント：\n1）記憶装置は主記憶と補助記憶に分かれる点が頻出。\n2）CPUとの役割の違いで混同しやすい。\n講師の一言：覚える場所が記憶装置、考えるんはCPUや！",
    "categoryId": "TECHNOLOGY.HARDWARE"
  },
  {
    "id": 55,
    "term": "ユーザインタフェース",
    "meaning": "人がシステムや機器を操作するための接点となる仕組み",
    "detail": "① 説明：\nユーザインタフェースは、人とコンピュータが情報をやり取りするための画面や操作方法を指す。\n操作のしやすさや分かりやすさが重視される。\n\n② 仕組みや特徴：\n画面表示、ボタン配置、文字の大きさなどを工夫して設計される。\n利用者が迷わず操作できることが重要。\n\n③ 身近な例え：\n自動販売機で、どのボタンを押せば買えるか一目で分かる表示。\n直感的に使えるイメージ。\n\n④ 試験のポイント：\n1）ユーザインタフェースは人とシステムの接点として頻出。\n2）内部処理ではなく操作部分である点を混同しやすい。\n講師の一言：使う人目線で作られてるか、そこが勝負や！",
    "categoryId": "TECHNOLOGY.INFO_DESIGN"
  },
  {
    "id": 56,
    "term": "ユーザビリティ",
    "meaning": "利用者にとっての使いやすさの度合い",
    "detail": "① 説明：\nユーザビリティは、システムや製品がどれだけ簡単に、迷わず使えるかを表す考え方。\n情報デザインで重要な評価軸。\n\n② 仕組みや特徴：\n操作の分かりやすさ、学習のしやすさ、ミスの起きにくさなどで評価される。\n利用者の負担を減らす点が特徴。\n\n③ 身近な例え：\n初めて使うスマホでも、説明書なしで操作できる感じ。\n直感的に分かるイメージ。\n\n④ 試験のポイント：\n1）ユーザビリティは使いやすさを表す用語として頻出。\n2）見た目の美しさだけではない点で混同しやすい。\n講師の一言：見た目だけやなく、使いやすさが大事やで！",
    "categoryId": "TECHNOLOGY.INFO_DESIGN"
  },
  {
    "id": 57,
    "term": "アクセシビリティ",
    "meaning": "誰もが情報やサービスを利用できるようにする考え方",
    "detail": "① 説明：\nアクセシビリティは、年齢や障害の有無に関係なく、すべての人が情報にアクセスできるようにする考え方。\n情報デザインの重要な要素。\n\n② 仕組みや特徴：\n文字サイズの調整、音声読み上げ、色の工夫などで利用しやすくする。\n利用者の多様性を考慮する点が特徴。\n\n③ 身近な例え：\n段差にスロープを付けて、誰でも通れるようにする感じ。\n利用のハードルを下げるイメージ。\n\n④ 試験のポイント：\n1）アクセシビリティは誰でも利用できる設計思想として頻出。\n2）健常者だけを対象にしない点で混同しやすい。\n講師の一言：みんなが使えるように考える、それがアクセシビリティや！",
    "categoryId": "TECHNOLOGY.INFO_DESIGN"
  },
  {
    "id": 58,
    "term": "文字コード",
    "meaning": "文字をコンピュータで扱うために数字に対応づけた仕組み",
    "detail": "① 説明：\n文字コードは、文字や記号をコンピュータが理解できる数値に変換するためのルール。\n文字を正しく表示や保存するために必要になる。\n\n② 仕組みや特徴：\nそれぞれの文字に決められた番号が割り当てられている。\n文字コードが違うと、文字化けが起こる。\n\n③ 身近な例え：\n名前に出席番号を付けて管理する感じ。\n番号が合わないと別人になるイメージ。\n\n④ 試験のポイント：\n1）文字コードは文字を数値で表す仕組みとして頻出。\n2）文字コードの違いによる文字化けと混同しやすい。\n講師の一言：文字も番号で管理されてる、そこ押さえとき！",
    "categoryId": "TECHNOLOGY.INFO_MEDIA"
  },
  {
    "id": 59,
    "term": "解像度",
    "meaning": "画像や映像のきめ細かさを表す度合い",
    "detail": "① 説明：\n解像度は、画像や画面がどれだけ細かく表示できるかを示す指標。\n情報メディアの品質を判断する要素になる。\n\n② 仕組みや特徴：\n点の数が多いほど、細かくはっきり表示される。\n解像度が低いと、画像が粗く見える。\n\n③ 身近な例え：\nドット絵と写真を比べたときの細かさの違い。\n点が多いほどきれいなイメージ。\n\n④ 試験のポイント：\n1）解像度は表示の細かさを表す用語として頻出。\n2）画面サイズと混同しやすい。\n講師の一言：大きさやなく細かさ、それが解像度や！",
    "categoryId": "TECHNOLOGY.INFO_MEDIA"
  },
  {
    "id": 60,
    "term": "データ圧縮",
    "meaning": "データの大きさを小さくして扱いやすくする処理",
    "detail": "① 説明：\nデータ圧縮は、画像や音声などのデータ量を減らして保存や通信をしやすくする処理。\n情報メディアの効率的な利用に役立つ。\n\n② 仕組みや特徴：\n不要な情報を省いたり、規則性を利用してデータ量を減らす。\n元に戻せる方式と戻せない方式がある。\n\n③ 身近な例え：\n服をたたんでカバンに詰めると、たくさん入るようになる感じ。\n中身は同じでも場所を取らないイメージ。\n\n④ 試験のポイント：\n1）データ圧縮はデータ量削減が目的として頻出。\n2）元に戻せるかどうかの違いで混同しやすい。\n講師の一言：小さくしても使える、それが圧縮のええとこや！",
    "categoryId": "TECHNOLOGY.INFO_MEDIA"
  },
  {
    "id": 61,
    "term": "データベース",
    "meaning": "大量のデータを整理して効率よく管理・利用するための仕組み",
    "detail": "① 説明：\nデータベースは、データを決まった形式で保存し、必要なときにすぐ取り出せるようにした仕組み。\n重複や無駄を減らして管理できる。\n\n② 仕組みや特徴：\nデータは表の形などで整理され、検索や更新がしやすい。\n複数の利用者が同時に使えるよう管理されている。\n\n③ 身近な例え：\n学校の名簿を、学年や出席番号順にまとめて管理している感じ。\n探したい情報がすぐ見つかるイメージ。\n\n④ 試験のポイント：\n1）データベースはデータを一元管理する仕組みとして頻出。\n2）単なるファイル保存との違いで混同しやすい。\n講師の一言：整理して一括管理、これがデータベースや！",
    "categoryId": "TECHNOLOGY.DATABASE"
  },
  {
    "id": 62,
    "term": "主キー",
    "meaning": "データを一意に識別するための項目",
    "detail": "① 説明：\n主キーは、表の中で一つ一つのデータを区別するために使われる項目。\n同じ値が重ならないことが条件。\n\n② 仕組みや特徴：\n主キーを使うことで、特定のデータを正確に検索や更新ができる。\n空白のままにすることはできない。\n\n③ 身近な例え：\n生徒一人ひとりに割り当てられた出席番号。\n番号が同じ人がいないイメージ。\n\n④ 試験のポイント：\n1）主キーはデータを一意に識別する項目として頻出。\n2）重複できない点で他の項目と混同しやすい。\n講師の一言：被ったらあかん番号、それが主キーや！",
    "categoryId": "TECHNOLOGY.DATABASE"
  },
  {
    "id": 63,
    "term": "正規化",
    "meaning": "データの重複や無駄をなくすために表を整理すること",
    "detail": "① 説明：\n正規化は、データベースの表を分割・整理して、無駄な重複を減らす考え方。\nデータの整合性を保つ目的がある。\n\n② 仕組みや特徴：\n同じ情報を何度も持たないように表を分ける。\n更新や修正がしやすくなる点が特徴。\n\n③ 身近な例え：\n連絡先を一つのメモにまとめて、何度も書かなくて済むようにする感じ。\n管理を楽にするイメージ。\n\n④ 試験のポイント：\n1）正規化はデータの重複を防ぐ手法として頻出。\n2）表を分ける目的を理解していないと混同しやすい。\n講師の一言：無駄減らして管理しやすく、それが正規化や！",
    "categoryId": "TECHNOLOGY.DATABASE"
  },
  {
    "id": 64,
    "term": "LAN",
    "meaning": "建物や敷地内など限られた範囲で構成されるネットワーク",
    "detail": "① 説明：\nLANはLocal Area Networkの略で、学校や会社、家庭などの狭い範囲で機器をつなぐネットワーク。\n身近で最もよく使われる形態。\n\n② 仕組みや特徴：\nパソコンやプリンタなどをケーブルや無線で接続する。\n通信速度が速く、管理しやすい点が特徴。\n\n③ 身近な例え：\nクラス内で回す連絡ノートのようなもの。\n近い人同士ですぐ情報共有できるイメージ。\n\n④ 試験のポイント：\n1）LANは限定された範囲のネットワークとして頻出。\n2）広い範囲をつなぐWANとの違いで混同しやすい。\n講師の一言：近場をつなぐんがLAN、まずここ押さえよ！",
    "categoryId": "TECHNOLOGY.NETWORK"
  },
  {
    "id": 65,
    "term": "IPアドレス",
    "meaning": "ネットワーク上の機器を識別するための番号",
    "detail": "① 説明：\nIPアドレスは、ネットワークにつながる機器一つ一つに割り当てられる識別番号。\n通信相手を特定するために使われる。\n\n② 仕組みや特徴：\n送信先と送信元のIPアドレスをもとにデータが届けられる。\n同じネットワーク内で重複しないよう管理される。\n\n③ 身近な例え：\n手紙を送るときの住所のようなもの。\n宛先がないと届かないイメージ。\n\n④ 試験のポイント：\n1）IPアドレスは機器を識別する番号として頻出。\n2）MACアドレスとの役割の違いで混同しやすい。\n講師の一言：住所みたいなもんやと思たら分かりやすいで！",
    "categoryId": "TECHNOLOGY.NETWORK"
  },
  {
    "id": 66,
    "term": "プロトコル",
    "meaning": "ネットワークで通信を行うための決まりごと",
    "detail": "① 説明：\nプロトコルは、データの送り方や受け取り方を定めた通信のルール。\n異なる機器同士が正しく通信するために必要。\n\n② 仕組みや特徴：\n送信手順やエラー時の対応などが細かく決められている。\n同じプロトコルを使うことで通信が成り立つ。\n\n③ 身近な例え：\n会話で同じ言語を使わないと意思疎通できないのと同じ。\n共通ルールのイメージ。\n\n④ 試験のポイント：\n1）プロトコルは通信のルールを表す用語として頻出。\n2）通信機器そのものと混同しやすい。\n講師の一言：ルール合ってへんと会話成立せえへんで！",
    "categoryId": "TECHNOLOGY.NETWORK"
  },
  {
    "id": 67,
    "term": "マルウェア",
    "meaning": "コンピュータに被害を与える目的で作られた悪意のあるソフトウェア",
    "detail": "① 説明：\nマルウェアは、不正な動作をさせたり情報を盗んだりするために作られたソフトウェアの総称。\n利用者に気づかれずに動くことが多い。\n\n② 仕組みや特徴：\nウイルスやワームなどが含まれ、感染するとデータ破壊や情報漏えいが起こる。\nメールの添付ファイルや不正なサイトから侵入することが多い。\n\n③ 身近な例え：\n知らない人が家に入り込んで、勝手に物を持ち出す感じ。\n気づいたときには被害が出ているイメージ。\n\n④ 試験のポイント：\n1）マルウェアは悪意のあるソフトウェアの総称として頻出。\n2）特定の種類名とまとめて問われる点で混同しやすい。\n講師の一言：悪さするソフト全部まとめてマルウェアや！",
    "categoryId": "TECHNOLOGY.SECURITY"
  },
  {
    "id": 68,
    "term": "ファイアウォール",
    "meaning": "外部からの不正な通信を防ぐための仕組み",
    "detail": "① 説明：\nファイアウォールは、ネットワークの出入り口で通信を監視し、危険な通信を遮断する仕組み。\n内部ネットワークを守る役割を持つ。\n\n② 仕組みや特徴：\nあらかじめ決めたルールに基づいて、通信を通すか止めるか判断する。\n不正アクセス対策の基本となる。\n\n③ 身近な例え：\n学校の門で、不審な人を中に入れないように見張る警備員。\n入口でチェックするイメージ。\n\n④ 試験のポイント：\n1）ファイアウォールは通信を制御する仕組みとして頻出。\n2）ウイルス対策ソフトとの役割の違いで混同しやすい。\n講師の一言：入口で止める番人、それがファイアウォールや！",
    "categoryId": "TECHNOLOGY.SECURITY"
  },
  {
    "id": 69,
    "term": "認証",
    "meaning": "利用者が正しい本人かどうかを確認する仕組み",
    "detail": "① 説明：\n認証は、システムを利用しようとする人が本人であることを確認するための仕組み。\n不正利用を防ぐ目的がある。\n\n② 仕組みや特徴：\nIDやパスワードなどの情報を使って確認する。\n本人確認ができて初めて利用が許可される。\n\n③ 身近な例え：\n学校に入るときに、生徒証を見せて確認してもらう感じ。\n本人かどうかを確かめるイメージ。\n\n④ 試験のポイント：\n1）認証は本人確認を行う仕組みとして頻出。\n2）利用権限を決める認可との違いで混同しやすい。\n講師の一言：まず本人確認、それ通らんと先進まへんで！",
    "categoryId": "TECHNOLOGY.SECURITY"
  }
]
