[
  {
    "id": 1,
    "term": "GUI",
    "meaning": "アイコンやマウスを使って、視覚的に直感的な操作ができる仕組み",
    "detail": "コンピュータの操作を、文字ではなく図や画像で分かりやすくした画面構成のこと。\n難しい命令文を覚えなくても、画面を見てマウスや指で操作できるのが最大の特徴。\nスマホのホーム画面に並んでいるアイコンをタップするのも、まさにGUIなんやね。\nこれのおかげで、専門知識がない人でも簡単にIT機器を使いこなせるようになったわけ。\n試験では、文字だけで操作する「CUI」という用語とセットで出題されるから注意して！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["インターフェース", "CUI", "アイコン", "ユーザビリティ"]
  },
  {
    "id": 2,
    "term": "プラグアンドプレイ",
    "meaning": "周辺機器を接続すると、OSが自動で設定を行ってくれる機能",
    "detail": "新しいマウスやキーボードをパソコンに繋いだ瞬間、すぐに使えるようになる便利な仕組みのこと。\nOSが接続を検知して、必要な「デバイスドライバ」を自動的に割り当ててくれるんやわ。\n身近な例で言うと、USBメモリを差し込むだけでファイルが開けるようになるのがこれに当たるね。\n昔はいちいち自分で難しい設定をしていたけれど、今は差し込む（Plug）だけで動く（Play）から本当に楽。\n試験では「自動的にデバイスドライバが組み込まれる機能」というキーワードを確実に押さえておいてな！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["周辺機器", "デバイスドライバ", "USB", "自動設定"]
  },
  {
    "id": 3,
    "term": "OSS",
    "meaning": "ソースコードが公開されており、誰でも改良や再配布ができるソフトウェア",
    "detail": "ソフトの設計図にあたる「ソースコード」がタダで一般公開されているもののこと。\n誰でも中身を確認できるから、世界中のエンジニアが協力してバグを直したり機能を増やしたりできるんやね。\n具体的な例を挙げると、ブラウザの「Firefox」やサーバー用OSの「Linux」などが有名。\n営利目的での利用も認められているけれど、全くルールがないわけではなく、独自のライセンス（利用規約）がある点には注意が必要。\n試験では、著作権が放棄されているわけではない、というひっかけ問題によく出るから気をつけて！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["Linux", "ソースコード", "ライセンス", "知的財産権"]
  },
  {
    "id": 4,
    "term": "ディレクトリ",
    "meaning": "コンピュータ内でファイルを整理・分類するための「箱」のこと",
    "detail": "WindowsやMacでいうところの「フォルダ」と同じ意味やと思って大丈夫。\nこれを使うことで、大量のデータを「写真」「学校」「遊び」みたいに分けて管理できるんやね。\n身近な例で言うと、机の引き出しの中に「教科書用」や「プリント用」の仕切りを作るのと似てるわ。\n一番上の階層を「ルートディレクトリ」、その中にあるものを「サブディレクトリ」と呼ぶのが一般的。\n試験では、この階層構造（ツリー構造）の仕組みがよく問われるからしっかり理解しといてな！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["フォルダ", "階層構造", "ファイル管理", "ルートディレクトリ"]
  },
  {
    "id": 5,
    "term": "仮想メモリ",
    "meaning": "主記憶装置（メモリ）の容量不足を、補助記憶装置（HDDなど）を使って補う仕組み",
    "detail": "実行したいアプリが多すぎてメモリがいっぱいになったとき、ハードディスクの一部をメモリ代わりにする機能のこと。\nこれがあるおかげで、本来のメモリ容量を超える大きなプログラムも動かすことができるんやわ。\n例えるなら、机の上が勉強道具でいっぱいになったとき、一時的に隣の空いている椅子に教科書を置いて作業スペースを広げるようなもんやね。\nただし、本物のメモリより読み書きのスピードはガクンと落ちてしまうのが弱点。\n試験では「主記憶の容量を補うために、補助記憶の一部を仮想的に利用する」という説明が頻出やで！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["メモリ", "主記憶装置", "補助記憶装置", "ページング"]
  },
  {
    "id": 6,
    "term": "アーカイブ",
    "meaning": "複数のファイルを一つにまとめたり、長期間保存するために専用の場所に保管すること",
    "detail": "バラバラになったデータをひとまとめに整理して、後で取り出しやすいように記録保存することを指すんやね。\n日常的な場面やと、メールを削除せずに「アーカイブ」機能を使って、受信トレイをスッキリさせる使い方がおなじみかも。\nITの世界では、単にまとめるだけでなく、容量を小さくする「圧縮」とセットで行われることが多いわ。\n大事な思い出の写真をアルバムにまとめて本棚にしまう、そんなイメージやな。\n試験では「複数のファイルを一つにまとめること」という基本の意味をまず押さえといて！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["圧縮", "バックアップ", "整理", "ファイル"]
  },
  {
    "id": 7,
    "term": "CPU",
    "meaning": "コンピュータの各装置を制御し、データの演算を行う「頭脳」にあたる部品",
    "detail": "マウスからの入力に反応したり、計算をしたりと、コンピュータのあらゆる命令をさばくパーツのこと。\n性能が良いほど、複雑な処理もサクサクこなせるようになるんやね。\n人間に例えるなら、まさに計算や判断を行う「脳みそ」そのものやわ。\nスマホを選ぶときに「チップ」や「プロセッサ」と呼ばれているのも、このCPUのことやと思えばOK。\n試験では「制御」と「演算」という2つの大きな役割をセットで覚えるのが合格への近道やで！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["プロセッサ", "演算", "制御", "ハードウェア"]
  },
  {
    "id": 8,
    "term": "主記憶装置",
    "meaning": "CPUが直接読み書きを行う、実行中のプログラムやデータを一時的に保存する場所",
    "detail": "コンピュータが今まさに使っている情報を置いておくための高速な記憶装置のこと。\n電源を切ると中身が消えてしまう「揮発性」という性質があるんやわ。\nよく例えられるのは「机の広さ」やね。机が広いほど、たくさんの参考書（アプリ）を同時に広げて効率よく勉強（作業）できるわけ。\nスマホのスペック表にある「メモリ 8GB」といった数字がこれに当たるんやで。\n試験では、補助記憶装置（SSDなど）よりも高速やけど、容量あたりの価格が高いという特徴を押さえといてな！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["RAM", "揮発性", "メモリ", "実行メモリ"]
  },
  {
    "id": 9,
    "term": "補助記憶装置",
    "meaning": "プログラムやデータを長期間保存するための装置で、電源を切っても内容が消えないのが特徴",
    "detail": "SSDやHDD（ハードディスク）、USBメモリのように、データをずっと取っておくための場所のこと。\n主記憶装置（メモリ）に入りきらないデータや、今は使わないアプリをしまっておく役割があるんやね。\n例えるなら、机の横にある「本棚」や「引き出し」のようなイメージやわ。\n容量はめちゃくちゃ大きいけれど、CPUが直接データを読み書きできないから、一度メモリに移す必要があるんやで。\n試験では、SSDはHDDに比べて「衝撃に強く、読み書きが速い」というメリットがよく出るから要注意や！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["SSD", "HDD", "ストレージ", "不揮発性"]
  },
  {
    "id": 10,
    "term": "バス",
    "meaning": "コンピュータの各装置間でデータをやり取りするための共通の伝送路",
    "detail": "CPUやメモリ、周辺機器の間を結ぶ「データの通り道」のことやね。\nここが太くて速いほど、一度にたくさんのデータを運べるから、コンピュータ全体のスピードが上がるんやわ。\n身近な例で言うと、道路の「車線数」みたいなもんやな。車線が多いほど、渋滞せずにスムーズに車が流れるやろ？\nCPUの内部で使う「内部バス」と、周辺機器を繋ぐ「外部バス」の種類があるんやで。\n試験では「各装置を結ぶデータの伝送路」という言葉が出てきたら、バスのことやと思って間違いなしや！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["伝送路", "データ転送", "内部バス", "外部バス"]
  },
  {
    "id": 11,
    "term": "入力装置",
    "meaning": "人間がコンピュータに対して指示やデータを与えるための装置",
    "detail": "私たちの考えや操作を、デジタルデータに変えてコンピュータに伝えるための道具のこと。\nこれがないと、コンピュータに何をしてほしいか命令を伝えることができへんのやね。\n代表的なのはキーボードやマウス、スマホのタッチパネル、それから音声を拾うマイクなんかもそうやわ。\nゲームで使うコントローラーも、自分の「動かしたい」という意思を伝える立派な入力装置やね。\n試験では、バーコードリーダーやスキャナも入力装置に含まれることをしっかり覚えておいてな！",
    "categoryId": "TECHNOLOGY.HARDWARE",
    "tags": ["キーボード", "マウス", "タッチパネル", "スキャナ"]
  },
  {
    "id": 12,
    "term": "出力装置",
    "meaning": "コンピュータが処理した結果を、人間がわかる形で見せてくれる装置",
    "detail": "コンピュータの中で計算されたデータを、文字や画像、音として私たちに届けてくれる部品のこと。\nこれがあるからこそ、私たちはコンピュータが何を考えているかを知ることができるんやわ。\n身近な例やと、パソコンのモニター（ディスプレイ）や、紙に印刷するプリンタ、音が鳴るスピーカーがこれに当たるね。\n最近やと、VRゴーグルなんかも没入感のある映像を出す高度な出力装置の一つやな。\n試験では、ディスプレイの解像度やプリンタの印刷方式とセットで聞かれることが多いから要注意やで！",
    "categoryId": "TECHNOLOGY.HARDWARE",
    "tags": ["ディスプレイ", "プリンタ", "モニター", "スピーカー"]
  },
  {
    "id": 13,
    "term": "2進数",
    "meaning": "「0」と「1」の2種類の数字だけで全ての数を表現する方法",
    "detail": "コンピュータは電気の「ON（1）」と「OFF（0）」でしか物事を判断できへんから、この数え方を使ってるんやね。\n私たちが普段使っている10進数は「10」で桁が上がるけど、2進数は「2」になったらすぐ次の桁に上がるんやわ。\n身近な例で言うと、電球のスイッチの「入・切」をイメージすると分かりやすいかも。\n最初は戸惑うかもしれんけど、慣れると「0、1、10、11…」とパズル感覚で数えられるようになるで。\n試験では、10進数から2進数への変換問題がよく出るから、計算手順を練習しておくのが合格のポイントや！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["2進法", "10進数", "デジタル", "ビット"]
  },
  {
    "id": 14,
    "term": "ビット（bit）",
    "meaning": "コンピュータが扱う情報の最小単位",
    "detail": "2進数の「0」か「1」のどちらか1つが入る、情報の最小の「箱」のことやね。\n1ビットなら2通り（0か1）、2ビットなら4通り（00, 01, 10, 11）の情報を表せるんやわ。\n例えるなら、YESかNOだけで答える「究極の2択アンケート」1回分が1ビットやと思えばええよ。\nビット数が増えれば増えるほど、一度に表現できる色の数や情報のパターンが増えていくんやね。\n試験では「nビットで $2^n$ 通りの情報を表現できる」という公式をしっかり頭に入れといてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["情報単位", "データ量", "2進数", "最小単位"]
  },
  {
    "id": 15,
    "term": "バイト（Byte）",
    "meaning": "ビットを8個まとめた情報の単位で、1バイト＝8ビット",
    "detail": "「ビット」は細かすぎるから、実務ではこの「バイト」をひと塊として扱うのが一般的やね。\n1バイト（8ビット）あれば、256通りの情報を表せるから、半角の英数字1文字分を表現できるんやわ。\nスマホの通信制限で聞く「GB（ギガバイト）」の「バイト」もこれのこと。おなじみの単位やね。\n1ビットが小銭の1円玉やとしたら、バイトは5円玉…いや、キリよく8円玉という塊があるイメージかな。\n試験では「1Byte = 8bit」という計算は超重要。k（キロ）やM（メガ）といった単位の変換も一緒に覚えといて！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["Byte", "bit", "データ量", "単位変換"]
  },
  {
    "id": 16,
    "term": "k, M, G, T",
    "meaning": "データの大きさを表すために、単位の前に付ける記号",
    "detail": "ビットやバイトだけでは数が大きくなりすぎるから、1000倍（正確には1024倍）ごとに名前を変えていくんやわ。\n小さい順に、k（キロ）、M（メガ）、G（ギガ）、T（テラ）と続いていくんやね。\n身近な例やと、スマホの通信量「5ギガ（5GB）」や、写真1枚のサイズ「3メガ（3MB）」といった言葉で毎日使ってるはず。\n「キロキロと太って（M）メガギガ（G）寺（T）へ」なんて語呂合わせで順番を覚えるのも一つの手やね。\n試験では、それぞれが $10^3$（約1000）倍ずつ増えていく関係をしっかり整理しておいて！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["キロ", "メガ", "ギガ", "テラ", "データ量"]
  },
  {
    "id": 17,
    "term": "文字コード",
    "meaning": "文字一つひとつに割り当てられた固有の数字（ビット列）のルール",
    "detail": "コンピュータは「あ」や「A」という文字をそのまま理解できへんから、数字に変換して処理してるんやね。\n世界中で共通のルールがないと、送ったメールが文字化けして読めなくなってしまうんやわ。\n例えるなら、モールス信号の「ト・ツー」が特定の文字を表すのと似たような仕組みやな。\n代表的なものに、英数字のみの「ASCII」や、世界中の文字を扱える「Unicode（UTF-8）」があるで。\n試験では、世界標準の「Unicode」という名前と、文字化けがなぜ起こるのかという理由をセットで押さえといてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["ASCII", "Unicode", "UTF-8", "文字化け"]
  },
  {
    "id": 18,
    "term": "フォント",
    "meaning": "コンピュータで表示・印刷される文字のデザイン（書体）",
    "detail": "同じ「あ」という文字でも、角ばっていたり丸まっていたり、色んな見た目があるやろ？\n大きく分けると、文字の端に飾りがある「明朝体」と、太さが一定の「ゴシック体」の2種類が有名やね。\n身近な例やと、学校の課題は「明朝体」、プレゼンのスライドは見やすい「ゴシック体」といった使い分けをしてるはずやわ。\nデータ形式としては、拡大してもギザギザにならない「アウトラインフォント」が今の主流やね。\n試験では、用途に合わせたフォント選びが「情報デザイン」の観点でも大切やってことを覚えておいて！",
    "categoryId": "TECHNOLOGY.INFO_DESIGN",
    "tags": ["明朝体", "ゴシック体", "アウトラインフォント", "ビットマップフォント"]
  },
  {
    "id": 19,
    "term": "アルゴリズム",
    "meaning": "問題を解決するための手順や計算のやり方のこと",
    "detail": "コンピュータに「どういう順番で何をさせるか」という具体的なレシピみたいなもんやね。\n同じ結果を出すにしても、効率の良いアルゴリズムを使えば処理がめちゃくちゃ速くなるんやわ。\n身近な例で言うと、カレーを作る時の「野菜を切る→炒める→煮込む」という手順そのものがアルゴリズムやね。\nこの段取りがバラバラやと、美味しいカレー（正しい結果）は完成せえへんやろ？\n試験では、代表的なアルゴリズムとして「探索（データを探す）」や「整列（並べ替える）」があることを知っておいてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["手順", "プログラム", "フローチャート", "効率化"]
  },
  {
    "id": 20,
    "term": "フローチャート",
    "meaning": "アルゴリズムなどの処理の手順を、図形を使って視覚的に表したもの",
    "detail": "言葉で説明するとややこしい手順を、「〇」や「◇」の記号を使って誰でも分かるように図解したもんやね。\n矢印を辿っていくだけで、次に何をすればいいか一目で分かるから、設計図として使われるんやわ。\n例えるなら、スマホゲームのイベント攻略チャートや、避難訓練の経路図みたいなイメージやな。\n「もしHPが0になったらゲームオーバーへ」といった条件分岐も、ひし形の記号一つでスッキリ表現できるんやで。\n試験では、開始・終了の端子や、判断（ひし形）の記号の意味を問われるから、形と役割を一致させといて！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["アルゴリズム", "図解", "処理手順", "設計図"]
  },
  {
    "id": 21,
    "term": "変数",
    "meaning": "データを入れておくために、プログラムの中で名前を付けた「箱」のこと",
    "detail": "計算結果を一時的に覚えさせたり、ユーザーが入力した文字を保存したりするために使うんやね。\n「score = 100」みたいに書くと、scoreという名前の箱に100という数字が入るイメージやわ。\n身近な例やと、ゲームの「プレイヤー名」や「所持金」がこれに当たるね。中身がどんどん書き換わるから「変」わる「数」なんやわ。\n一度箱に入れてしまえば、後から何度でもその中身を取り出して使うことができるんやで。\n試験では、変数に値を代入する（入れる）という考え方が全てのプログラミング問題の基礎になるから、しっかりマスターしてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["代入", "データ", "プログラミング", "保存"]
  },
  {
    "id": 22,
    "term": "制御構造",
    "meaning": "プログラムの流れを作る「順次」「選択」「繰返し」の3つの形",
    "detail": "どんなに複雑なプログラムも、実はこの3つの組み合わせだけでできているんやわ。\n上から順に進む「順次」、条件で分かれる「選択」、同じことを繰り返す「繰返し」のことやね。\n身近な例やと、自動販売機が分かりやすいわ。「お金を入れる（順次）」→「金額が足りるか確認（選択）」→「お釣りを10円ずつ出す（繰返し）」といった感じやね。\nこの考え方を「構造化プログラミング」って呼んだりもするんやで。\n試験では、フローチャートを見て「これはどの構造かな？」と見分ける問題がよく出るから、パズルを解く感覚で慣れておいてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["順次", "選択", "繰返し", "制御構造"]
  },
  {
    "id": 23,
    "term": "機械学習（マシンラーニング）",
    "meaning": "大量のデータからコンピュータが自らルールやパターンを学び出す仕組み",
    "detail": "人間がいちいち「これは猫の画像やで」とルールを教えなくても、AIが自分で特徴を見つけ出す技術のことやね。\nデータが多ければ多いほど、AIの「目」や「判断」はどんどん正確になっていくんやわ。\n身近な例やと、YouTubeの「おすすめ動画」や、迷惑メールの自動振り分けなんかがこれを利用してるね。\nAIが勝手に賢くなっていくなんて、ちょっと不思議な感じがするやろ？\n試験では、AIを実現するための代表的な手法が「機械学習」である、という点に注目してな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["AI", "人工知能", "ディープラーニング", "ビッグデータ"]
  },
  {
    "id": 24,
    "term": "ディープラーニング（深層学習）",
    "meaning": "人間の脳の神経回路を模したモデルを使い、より高度な判断をさせる機械学習の手法",
    "detail": "機械学習の中でも特にすごいやつで、人間の脳と同じような仕組み（ニューラルネットワーク）を使っているんやわ。\nこれのおかげで、画像認識や翻訳の精度が、人間と変わらないレベルまで一気に上がったんやね。\n身近な例やと、スマホの「顔認証」や、チェスや囲碁でプロに勝つAIなんかがこれの力やわ。\nいわば、AI界のエリート教育みたいなもんやと思えば分かりやすいかな。\n試験では「ニューラルネットワークを多層にしたもの」というフレーズが出てきたら、これのことやと即答してな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["AI", "ニューラルネットワーク", "画像認識", "機械学習"]
  },
  {
    "id": 25,
    "term": "リレーショナルデータベース（RDB）",
    "meaning": "データを複数の「表（テーブル）」の形式で管理するデータベース",
    "detail": "Excelのシートみたいに、縦の列と横の行でデータを整理する、今最もよく使われている方式やわ。\n複数の表を特定の項目（IDなど）で繋げることで、複雑な情報もスッキリ扱えるんやね。\n身近な例で言うと、図書室の管理システム。「本リスト」と「借りた人リスト」をIDで紐づけて管理してるんやわ。\nバラバラの表が関係（リレーション）を持つから、リレーショナルデータベースって呼ぶんやね。\n試験では「データを表形式で管理する」という特徴と、最も普及している方式やってことを覚えておいて！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["RDB", "テーブル", "SQL", "整理整頓"]
  },
  {
    "id": 26,
    "term": "主キー（プライマリキー）",
    "meaning": "データベースの表の中で、データを一意（唯一）に特定するための項目",
    "detail": "その項目を見れば、どのデータのことか絶対に間違いなく判別できる「背番号」みたいなもんやね。\n同じ値が二つあったり、中身が空っぽ（NULL）やったりすることは絶対に許されへんルールがあるんやわ。\n身近な例やと、学校の「出席番号」や「マイナンバー」がこれに当たるね。同姓同名がいても番号で区別できるやろ？\nこれが決まっているからこそ、膨大なデータの中から一瞬で目的の情報を見つけ出せるんやで。\n試験では「重複してはいけない」「空であってはいけない」という2つのルールが超頻出やから要注意！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["一意性", "インデックス", "レコード", "主キー"]
  },
  {
    "id": 27,
    "term": "SQL",
    "meaning": "データベースに対して、データの検索や操作を行うための専用言語",
    "detail": "データベースに「このデータを探して！」とか「新しいデータを追加して！」とお願いするための言葉やね。\n世界共通のルールやから、これさえ覚えれば色んな会社のシステムを操れるようになるんやわ。\n例えるなら、レストランで「Aランチ、ライス大盛りで」と注文する「注文票」みたいなもんやな。\nプログラミング言語とはまた違った、データベース専用の「魔法の呪文」やと思えばええよ。\n試験では、SELECT（選ぶ）、INSERT（入れる）、UPDATE（更新する）といった代表的な命令語の名前を知っておいてな！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["データベース言語", "検索", "操作", "リレーショナルデータベース"]
  },
  {
    "id": 28,
    "term": "プロトコル",
    "meaning": "ネットワークを通じてデータをやり取りするための「共通の約束事」",
    "detail": "コンピュータ同士が通信するとき、言葉が通じないと困るから、あらかじめ決めておくルールのことやね。\nデータの送り方や、エラーが起きたときの対処法などが細かく決まってるんやわ。\n身近な例で言うと、私たちが電話で「もしもし」と言ってから話し始める、あのマナーみたいなもんやね。\nインターネットで使われる「TCP/IP」や、Webサイトを見るための「HTTP」がその代表格やわ。\n試験では「異なるメーカーの機器同士でも、プロトコルさえ合えば通信できる」という点をしっかり押さえといてな！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["通信規約", "TCP/IP", "HTTP", "標準化"]
  },
  {
    "id": 29,
    "term": "IPアドレス",
    "meaning": "ネットワーク上のコンピュータを識別するための「住所」",
    "detail": "インターネットに繋がっている世界中の機器に割り振られた、重複のない番号のことやね。\nこれがあるからこそ、迷子にならずに目的の相手にデータを届けることができるんやわ。\n身近な例やと、家のポストにある「住所」や、スマホの「電話番号」と同じ役割やと思えばええよ。\n今は主流の「IPv4」に加えて、番号が足りなくなったから作られた「IPv6」という新しい規格も普及してるんやわ。\n試験では「ネットワーク上の住所」という言葉と、IPv4とIPv6の違いがよく問われるから要注意やで！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["IPv4", "IPv6", "住所", "インターネットプロトコル"]
  },
  {
    "id": 30,
    "term": "LANとWAN",
    "meaning": "繋がっているネットワークの「広さ」を表す区別",
    "detail": "家や学校といった限られた範囲内のネットワークをLAN、都市や国を越えて広く繋がるものをWANと呼ぶんやわ。\nLAN同士を通信事業者の回線を使って繋げたものが、大きなWANになるイメージやね。\n身近な例で言うと、家のWi-Fiに繋がってる状態が「LAN」で、一歩外に出て4Gや5Gでネットに繋ぐのが「WAN」を経由してることになるわ。\nちなみに、世界最大のWANこそが「インターネット」そのものなんやで。\n試験では、狭い範囲がLAN（Local）、広い範囲がWAN（Wide）という単語の意味の差を明確にしておいてな！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["LAN", "WAN", "Wi-Fi", "インターネット"]
  },
  {
    "id": 31,
    "term": "マルウェア",
    "meaning": "コンピュータに悪影響を及ぼす悪意のあるプログラムの総称",
    "detail": "「ウイルス」や「ワーム」など、悪いことをするソフトを全部まとめてこう呼ぶんやわ。\n自分のデータを勝手に消されたり、外に漏らされたりする危険があるから、本当に厄介な存在やね。\n身近な例で言うと、風邪のウイルスみたいなもんやな。どこから移るかわからんから、予防が大事なんやわ。\n最近やと、スマホのアプリに見せかけて情報を盗むタイプも増えてるから油断できへんね。\n試験では「悪意のあるソフトウェアの総称」という言葉が出たら、マルウェアやと即答できるようにしといて！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["コンピュータウイルス", "ワーム", "トロイの木馬", "スパイウェア"]
  },
  {
    "id": 32,
    "term": "フィッシング詐欺",
    "meaning": "偽のメールやWebサイトを使って、パスワードなどを盗み出す手口",
    "detail": "本物そっくりの偽サイトに誘導して、クレジットカード番号やIDを自分から入力させるズルいやり方やね。\n「アカウントが停止されました」なんて不安を煽るメールを送って、人を「釣る（Fishing）」のが語源やわ。\n身近な例やと、Amazonや銀行を名乗る怪しいメール。つい焦ってクリックしそうになるけど、そこが罠なんやね。\nURLが微妙に違ったり、日本語が変やったりすることが多いから、落ち着いて見極めるのがコツやで。\n試験では「偽のサイトへ誘導して個人情報を盗む」という具体的な流れをセットで覚えておいてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["サイバー攻撃", "個人情報", "なりすまし", "ソーシャルエンジニアリング"]
  },
  {
    "id": 33,
    "term": "二要素認証",
    "meaning": "パスワードだけでなく、もう一つの要素を組み合わせて本人確認を行う仕組み",
    "detail": "「知っていること（パスワード）」に加えて、「持っているもの（スマホ）」や「体の特徴（指紋）」を組み合わせて守りを固める方法やわ。\n万が一パスワードが漏れても、もう一つの鍵がないとログインできへんから、めちゃくちゃ安全なんやね。\n身近な例やと、ログインした時にスマホにショートメッセージ（SMS）で数字のコードが届くあれのことやわ。\n面倒に感じるかもしれんけど、大切なアカウントを守るためには最強の手段の一つなんやで。\n試験では、知識・所持・生体の「異なる3要素のうち2つを組み合わせる」という定義がよく出るから押さえといてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["多要素認証", "生体認証", "ワンタイムパスワード", "アカウント保護"]
  },
  {
    "id": 34,
    "term": "著作権（コピーライト）",
    "meaning": "文章、音楽、プログラムなどの作品を作った人を守る権利",
    "detail": "自分が苦労して作ったものを、他人に勝手にコピーされたり公開されたりせえへんための権利やね。\nプログラムやWebサイトのデザインも、この著作権でしっかり守られてるんやわ。\n身近な例で言うと、SNSに友達が撮った写真を勝手に載せたり、有料のソフトを友達にコピーしてあげるのはNG。これが権利の侵害やね。\n特別な手続きはいらんと、作品を作った瞬間に自動的に発生するのが特徴なんやで。\n試験では「プログラムのアルゴリズム（手順）自体には著作権は認められない」というひっかけがよく出るから注意してな！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["知的財産権", "プログラム", "ライセンス", "特許法"]
  },
  {
    "id": 35,
    "term": "産業財産権",
    "meaning": "特許権や商標権など、ビジネスに役立つ発明やデザインを守る4つの権利の総称",
    "detail": "新しい発明（特許）や、商品の名前（商標）など、仕事で使うアイデアを独占できる権利のことやね。\n著作権と違って、役所に申請して「登録」されへんと権利として認められへんのがポイントやわ。\n身近な例やと、iPhoneの「リンゴのマーク」や、任天堂の「Switch」という名前が商標権で守られてるね。\nこれを守ることで、他人が偽物を売って商売の邪魔をするのを防げるんやわ。\n試験では、特許権、実用新案権、意匠権、商標権の4つの違いを軽く整理しておくと点数が取りやすいで！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["特許権", "商標権", "意匠権", "実用新案権"]
  },
  {
    "id": 36,
    "term": "個人情報保護法",
    "meaning": "個人の権利や利益を守るために、個人情報の取り扱いを定めた法律",
    "detail": "氏名、生年月日、住所など、それだけで「あ、あの人のことや！」とわかる情報を安全に管理するためのルールやね。\n企業が預かったお客さんの情報を、勝手に売ったり漏らしたりせえへんように縛ってるんやわ。\n身近な例やと、お店でポイントカードを作る時に「利用目的に同意しますか？」と聞かれるのがこの法律に従ってる証拠やね。\n最近では、顔認証のデータやスマホのGPS情報も個人情報に含まれる場合があるから、かなり範囲が広がってるんやわ。\n試験では「生存する個人に関する情報」が対象であることをしっかり覚えておいてな！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["プライバシー", "機密保持", "コンプライアンス", "マイナンバー"]
  },
  {
    "id": 37,
    "term": "利益",
    "meaning": "売上からかかった費用を差し引いた、会社の手元に残る「儲け」のこと",
    "detail": "商売で一番大事な数字やね。単純に売上が大きくても、それ以上にコストがかかってたら赤字になってまうわ。\nITパスポートでは「売上高 － 費用 ＝ 利益」という超シンプルな計算式がすべての基本になるんやで。\n身近な例で言うと、100円で仕入れたお菓子を150円で売ったら、残りの50円が利益になる、という感じやな。\n会社はこの利益を使って、新しいアプリを作ったり社員の給料を払ったりするわけ。\n試験では、売上総利益や営業利益など、利益にはいくつか種類があることを頭の片隅に置いといて！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["売上", "費用", "損益計算書", "赤字・黒字"]
  },
  {
    "id": 38,
    "term": "変動費と固定費",
    "meaning": "売上の増減に合わせて変わる費用と、売上に関係なくかかる費用の区別",
    "detail": "会社のコストを2つの性格に分けたものやね。これを理解すると、あとどれくらい売れば黒字になるかが見えてくるんやわ。\n「変動費」は売れば売るほど増える材料費なんかで、「固定費」は売れなくてもかかる家賃や正社員の給料のこと。\n具体例を挙げると、たこ焼き屋さんで、タコ代は「変動費」やけど、屋台のレンタル代は「固定費」になるんやね。\nどれだけたくさん売っても、固定費は変わらんのがポイントやわ。\n試験では、この2つを使って「損益分岐点（利益がゼロになる売上高）」を計算する問題が出るから計算に慣れとこな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["コスト", "損益分岐点", "原価", "経営分析"]
  },
  {
    "id": 39,
    "term": "職能別組織",
    "meaning": "営業、製造、開発といった、仕事の種類（機能）ごとに分けた組織の形",
    "detail": "同じ専門スキルを持った人を集めてグループを作る、最も一般的な会社の仕組みやね。\nそれぞれの部署が専門性を高められるから、効率よく仕事が進められるというメリットがあるんやわ。\n学校の部活動で例えると「野球部」「吹奏楽部」みたいに、目的や得意なことで分かれているのと似てるかな。\n一方で、部署同士の横のつながりが弱くなりがち、という弱点もあるんやね。\n試験では「専門性を発揮しやすいが、部門間の壁ができやすい」という特徴をセットで覚えておいてな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["組織形態", "事業部制組織", "プロジェクト組織", "経営組織"]
  },
  {
    "id": 40,
    "term": "SWOT分析",
    "meaning": "自社の現状を、強み・弱み・機会・脅威の4つで分析する手法",
    "detail": "自分の会社の良いところと悪いところ、さらに外の世界のチャンスとピンチを整理して、作戦を立てるための道具やね。\n内部の「強み（Strength）・弱み（Weakness）」、外部の「機会（Opportunity）・脅威（Threat）」の頭文字を取ってるんやわ。\n身近な例で言うと、部活の試合前に「自分たちのサーブは強い（強み）けどスタミナがない（弱み）」、相手チームは「エースが怪我してる（機会）けど応援がすごい（脅威）」って分析するのと一緒やね。\nこれをやることで、今何をすべきかがハッキリ見えてくるわけ。\n試験では、どれが「内部環境」でどれが「外部環境」か、という分け方がよく問われるから整理しといてな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["経営戦略", "内部環境", "外部環境", "マーケティング"]
  },
  {
    "id": 41,
    "term": "マーケティングミックス（4P）",
    "meaning": "商品を売るために、4つの視点から戦略を組み合わせること",
    "detail": "何を（Product）、いくらで（Price）、どこで（Place）、どう広めるか（Promotion）の4つをバランスよく考えることやね。\nどんなに良い商品でも、値段が高すぎたり売ってる場所が少なかったら、ヒットはせえへんのやわ。\n具体例を挙げると、コンビニの新作スイーツ。「美味しそうな中身（P）」を「高校生が買える値段（P）」で「近くの店舗（P）」に置き、「SNS広告（P）」で知らせる。これが4Pやね。\nこの4つの「P」がバラバラにならず、カチッと噛み合うことが商売繁盛の秘訣なんやで。\n試験では、4つの「P」が何を指しているのか、英語の意味とセットでしっかり押さえといてな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["マーケティング", "4P", "商品企画", "販売戦略"]
  },
  {
    "id": 42,
    "term": "BtoC / BtoB",
    "meaning": "誰が誰に対して商売をしているかを表すビジネスモデルの形",
    "detail": "Bは企業（Business）、Cは消費者（Consumer）のことで、取引の相手が誰かをアルファベットで表してるんやね。\nBtoCは「企業から一般客へ」、BtoBは「企業から企業へ」という取引の流れのことやわ。\n身近な例で言うと、みんながコンビニでジュースを買うのは「BtoC」、そのコンビニが飲料メーカーから大量に仕入れるのは「BtoB」になるんやね。\n最近はメルカリみたいに「消費者同士」で売買する「CtoC」なんて言葉もよく聞くわ。\n試験では、それぞれの取引相手が誰と誰なのか、文字の意味を落ち着いて考えれば正解できるで！",
    "categoryId": "STRATEGY.BUSINESS_INDUSTRY",
    "tags": ["電子商取引", "EC", "BtoB", "BtoC"]
  },
  {
    "id": 43,
    "term": "プロジェクトマネジメント",
    "meaning": "期限内に、決められた予算と人数で目標を達成するための管理活動",
    "detail": "ただ闇雲に作業するんやなくて、全体を見渡して「段取り」をコントロールすることやね。\nいつまでに誰が何をやるか、お金は足りるか、トラブルは起きてないかを見守るのがマネージャの仕事なんやわ。\n身近な例やと、文化祭の出し物準備がまさにプロジェクトマネジメントやね。\n「当日（期限）」までに「クラスの予算（コスト）」で「最高の劇（目標）」を完成させるために、リーダーがみんなに指示を出すのと一緒やで。\n試験では、期間、コスト、品質の3つのバランスを取ることが重要やってことを押さえといて！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT",
    "tags": ["PMBOK", "工程管理", "進捗管理", "コスト管理"]
  },
  {
    "id": 44,
    "term": "ガントチャート",
    "meaning": "作業の予定と実績を横棒（バー）で表した進捗管理用の図",
    "detail": "縦軸に作業項目、横軸に時間をとって、いつどんな作業をするかを見える化した表のことやね。\n棒の長さで作業期間がわかるから、どこが遅れているか一目でチェックできるんやわ。\n例えるなら、学校のテスト前の「勉強計画表」みたいなもんやな。\n「月曜から水曜は数学」「木曜は英語」って横線で引いておけば、計画通り進んでるか一発でわかるやろ？\n試験では「進捗状況を視覚的に把握するための図」というキーワードが出たら、これのことやと思って間違いなしや！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT",
    "tags": ["工程表", "スケジュール管理", "WBS", "進捗管理"]
  },
  {
    "id": 45,
    "term": "SLA",
    "meaning": "サービスの提供者と利用者の間で交わされる、サービスの品質に関する約束事",
    "detail": "「このサービスはこれくらいの品質を保証しますよ」という内容を、あらかじめ文書にしておくことやね。\n例えば「ネットが繋がらない時間は年間で何分以内に抑えます」といった具体的な数値を決めるんやわ。\n身近な例やと、スマホの通信速度やサポートの返信時間に関する「契約の決まりごと」みたいなもんやね。\nもしこの約束が守られへんかったら、料金を返金するといったルールもここに含まれるんやで。\n試験では「サービス品質の保証範囲を明文化したもの」というポイントがよく出るから、しっかり覚えといてな！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT",
    "tags": ["サービス品質", "ITIL", "合意", "運用管理"]
  },
  {
    "id": 46,
    "term": "ウォーターフォールモデル",
    "meaning": "開発工程を「要件定義」から順に、滝が流れるように進める手法",
    "detail": "計画、設計、プログラミング、テストといった工程を一つずつ完璧に終わらせてから次へ進むやり方やね。\n後戻りができへんから、最初にしっかり計画を立てる必要があるんやわ。\n身近な例で言うと、学校の「卒業アルバム」作りみたいなもんかな。一度印刷してもうたら、後から「やっぱりこの写真に変えて！」って言うのは難しいやろ？\n大規模なシステムを作る時に、スケジュールが立てやすいからよく使われるんやで。\n試験では「前工程が完了してから次へ進む」「後戻りが困難」という特徴をセットで押さえといてな！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["システム開発", "開発工程", "V字モデル", "要件定義"]
  },
  {
    "id": 47,
    "term": "アジャイル開発",
    "meaning": "短い期間で「計画・開発・テスト」を繰り返し、素早く作り上げる手法",
    "detail": "「アジャイル」は「俊敏な」っていう意味。完璧な計画を立てるより、まずは動くものを作って、ユーザーの意見を聞きながら修正していくんやね。\n変化に強いから、流行り廃りが激しいスマホアプリの開発なんかにはピッタリのやり方やわ。\n具体例を挙げると、最初は最低限の機能だけのアプリを出して、毎週のようにアップデートして使いやすくしていく感じやね。\n失敗してもすぐ直せるから、今の時代にすごく合ってる手法なんやわ。\n試験では「短期間のサイクル」「仕様変更に柔軟に対応できる」というキーワードが頻出やで！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["スクラム", "イテレーション", "プロトタイプ", "迅速な開発"]
  },
  {
    "id": 48,
    "term": "テスト（単体・結合・システム）",
    "meaning": "プログラムが設計通りに正しく動くかを確認する作業",
    "detail": "バグ（間違い）がないか、色んな段階でチェックすることやね。\n部品単位で見る「単体テスト」、部品を繋げて見る「結合テスト」、全体を動かす「システムテスト」と順番に進めていくんやわ。\n身近な例やと、料理の「味見」やね。具材単体で火が通ってるか確認し、混ぜた時の味を見て、最後にお皿に盛って完成品をチェックするのと同じやわ。\nここで手を抜くと、後で大問題になるからめちゃくちゃ大事な工程なんやで。\n試験では、テストを進める順番と、それぞれの段階で何をチェックするのかを整理しといてな！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["デバッグ", "品質管理", "V字モデル", "ホワイトボックステスト"]
  },
  {
    "id": 49,
    "term": "IoT（Internet of Things）",
    "meaning": "身の回りのあらゆるモノがインターネットに繋がる仕組み",
    "detail": "「モノのインターネット」と呼ばれていて、家電や車、工場の機械などが情報をやり取りすることやね。\nセンサーで情報を集めて、スマホで遠隔操作したり、自動で最適な動きをさせたりできるんやわ。\n身近な例やと、外出先からスマホでエアコンをつけたり、冷蔵庫の中身を確認したりできる「スマート家電」がまさにこれやね。\n全てのモノが繋がることで、これまでにない便利なサービスがどんどん生まれてるんやわ。\n試験では「センサーで情報を収集し、ネットワーク経由で活用する」という流れをしっかり理解しといてな！",
    "categoryId": "TECHNOLOGY.SYSTEM_COMPONENTS",
    "tags": ["センサー", "スマートホーム", "エッジコンピューティング", "M2M"]
  },
  {
    "id": 50,
    "term": "5G",
    "meaning": "「高速大容量」「低遅延」「多数同時接続」が特徴の次世代通信規格",
    "detail": "4Gよりも圧倒的に速くて、遅れが少なく、たくさんの機器を一度に繋げられる通信技術のことやね。\n4Kや8Kの綺麗な動画も一瞬でダウンロードできるし、遠隔手術や自動運転といったリアルタイム性が大事な分野でも期待されてるんやわ。\n身近な例で言うと、スタジアムで数万人が一斉にスマホを使っても繋がりにくくならない、あの快適さが5Gの力やね。\nこれまでの「スマホのためのネット」から「あらゆるモノのためのネット」に進化したわけや。\n試験では、5Gの「3つの特徴（高速・低遅延・多接続）」を言葉通り完璧に覚えといて！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["通信規格", "超高速", "超低遅延", "多数同時接続"]
  },
  {
    "id": 51,
    "term": "ブロックチェーン",
    "meaning": "ネットワーク上の取引履歴を、みんなで分散して正しく記録する技術",
    "detail": "特定の管理者がいなくても、みんなでデータを監視し合うことで「改ざん（書き換え）」を事実上不可能にする仕組みのことやね。\n「鎖（チェーン）」のようにデータが繋がっているから、一箇所だけコッソリ変えてもすぐにバレてしまうんやわ。\n身近な例やと、ビットコインなどの「暗号資産（仮想通貨）」を支えている技術として有名やね。\n銀行を通さなくても安全にお金のやり取りができる、まさに「信頼の技術」と言えるんやわ。\n試験では「分散型台帳技術」という別名と、データの改ざんが極めて困難であるという特徴を押さえておいてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["暗号資産", "分散型台帳", "フィンテック", "改ざん耐性"]
  },
  {
    "id": 52,
    "term": "公開鍵暗号方式",
    "meaning": "「公開鍵」と「秘密鍵」のペアを使って、データを安全にやり取りする仕組み",
    "detail": "誰にでも渡してええ「公開鍵」で暗号化して、自分だけが持ってる「秘密鍵」で元に戻す（復号）というやり方やわ。\nこれなら、暗号を解くための鍵を相手に送る必要がないから、途中で盗まれる心配がないんやね。\n身近な例で言うと、南京錠（公開鍵）をみんなに配って、中身を見られたくない書類を入れてロックしてもらう感じ。\nその箱を開けられるのは、自分だけが持ってる本物の鍵（秘密鍵）だけ、というわけや。\n試験では、共通鍵暗号方式との違いや、デジタル署名に応用されることをしっかり押さえといてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["暗号化", "公開鍵", "秘密鍵", "デジタル署名"]
  },
  {
    "id": 54,
    "term": "システム監査",
    "meaning": "ITシステムが正しく、安全に、効率よく運用されているかを第三者がチェックすること",
    "detail": "自分たちで「大丈夫や！」って言うんやなくて、外部の専門家（システム監査人）に客観的に評価してもらうことやね。\n不正が行われてへんか、故障した時の対策はバッチリか、というポイントを厳しく見てもらうんやわ。\n身近な例やと、学校の「抜き打ち持ち物検査」や「外部評価」みたいなもんやと思えば分かりやすいかな。\nこれを受けることで、社会からの信頼を得ることができるんやね。\n試験では「監査人は独立した立場でなければならない（身内ではあかん）」という原則を絶対に忘れたらあかんで！",
    "categoryId": "MANAGEMENT.SYSTEM_AUDIT",
    "tags": ["監査人", "独立性", "情報セキュリティ監査", "内部統制"]
  },
  {
    "id": 55,
    "term": "関係データベース（RDB）",
    "meaning": "データを複数の「表（テーブル）」の形式で管理し、項目同士を関連付ける方式",
    "detail": "Excelのシートみたいな表をいくつか作って、それらを「ID」などで紐付けて管理するデータベースのことやね。\n今、世の中のほとんどのシステムがこの方式を使っている、いわば王道の管理方法なんやわ。\n身近な例やと、図書室の「本リスト」と「貸出記録リスト」を、本の番号で繋いで管理してるイメージやね。\n重複するデータを減らして、スッキリ整理できるのがええところなんやわ。\n試験では「表形式で管理する」「主キーを使って関連付ける」というフレーズがキーワードやで！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["RDB", "主キー", "SQL", "テーブル"]
  },
  {
    "id": 56,
    "term": "DX",
    "meaning": "IT技術を使って、ビジネスや社会の仕組みを根本から変えること",
    "detail": "単に紙をデータにするだけやなくて、ITの力で新しい価値を生み出し、生活をより良くしていく改革のことやね。\nこれからの時代、どんな会社もDXを進めな生き残られへんって言われるくらい大事な概念なんやわ。\n身近な例やと、映画を借りに行く「レンタルビデオ店」から、いつでもどこでも見れる「動画配信サービス（Netflixなど）」への変化がまさにDXやね。\n生活スタイルそのものがガラッと変わったやろ？\n試験では、単なる「IT化」以上の「社会やビジネスの変革」を指す言葉であることをしっかり覚えておいてな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["デジタル変革", "イノベーション", "AI", "データ活用"]
  },
{
    "id": 57,
    "term": "貸借対照表（B/S）",
    "meaning": "ある時点での会社の「資産」「負債」「純資産」の状態を表したもの",
    "detail": "別名「バランスシート」。会社が「どれだけお金を持っていて（資産）」「どれだけ借金があって（負債）」「本当の持ち分はいくらか（純資産）」を示す健康診断書みたいなもんやね。\n左側に「持ってるもの」、右側に「その元手」を書いて、左右の合計が必ず一致（バランス）するんやわ。\n身近な例やと、10万円のスマホを、貯金4万と親からの借金6万で買ったとしたら、資産10万、負債6万、純資産4万っていうB/Sになるわけや。\n試験では「財政状態を表す」というフレーズとセットで覚えとこな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["バランスシート", "財政状態", "資産", "負債"]
  },
  {
    "id": 58,
    "term": "損益計算書（P/L）",
    "meaning": "一定期間に会社が「どれだけ稼いで」「何にいくら使ったか」を表したもの",
    "detail": "会社の1年間の「成績表」やね。売上から色んな費用を引いて、最終的な利益を計算するんやわ。\nB/Sがある時点の「静止画」やとしたら、P/Lは1年間の「動画」やと思えばええよ。\n身近な例やと、1ヶ月のお小遣い帳やね。「バイト代（売上）－ 遊び代（費用）＝ 今月の残り（利益）」っていう流れそのものや。\n試験では「経営成績を表す」という言葉が出てきたらP/Lのことやで！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["利益", "売上", "費用", "経営成績"]
  },
  {
    "id": 59,
    "term": "キャッシュフロー計算書（C/F）",
    "meaning": "会社の中に「現金の流れ」がどうなっているかを表したもの",
    "detail": "帳簿上の利益だけやなくて、実際に「手元にある現金」がどう増減したかを見る書類やね。\n利益が出ていても、手元の現金がなくなると会社は潰れてしまう（黒字倒産）から、実はめちゃくちゃ大事な指標なんやわ。\n身近な例やと、メルカリで売れて「売上金」はあるけど、まだ銀行に振り込まれてなくて財布が空っぽ…っていう状態を防ぐためのチェック表やね。\n試験では、営業活動・投資活動・財務活動の3つの区分があることを知っておくと完璧や！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["現金", "黒字倒産", "資金繰り", "財務諸表"]
  },
  {
    "id": 60,
    "term": "ISO",
    "meaning": "電気分野を除くあらゆる分野で、国際的な標準（規格）を定める組織",
    "detail": "世界中で製品やサービスの品質を同じにするための「世界共通ルール」を作っている場所やね。\n例えば、ネジの太さやカードのサイズが世界中でバラバラやったら困るやろ？それを防いでるんやわ。\n身近な例やと、環境を守るルールの「ISO 14001」や、情報の守り方の「ISO 27001」という番号を、会社の看板やパンフレットで見たことあるかもしれんね。\n試験では「国際的な標準化組織」という言葉と、情報セキュリティの規格（ISMS）との関わりがよく出るで！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["国際規格", "標準化", "ISMS", "品質管理"]
  },
  {
    "id": 61,
    "term": "JIS",
    "meaning": "日本国内で使われる工業製品などの形や品質を定めた国家規格",
    "detail": "さっきのISOの「日本版」やと思えばええよ。日本の製品が安全で使いやすくなるように決めたルールやね。\n「JISマーク」がついている製品は、国が認めた安心のクオリティっていう証拠なんやわ。\n身近な例やと、ノートの大きさ（A4、B5など）や、トイレットペーパーの幅、鉛筆の硬さ（HBなど）も、このJISで決まってるんやで。\n試験では、日本の規格であることと、最近「日本工業規格」から「日本産業規格」に名前が変わったこともチェックポイントやわ！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["国内規格", "JISマーク", "標準化", "日本規格協会"]
  },
  {
    "id": 62,
    "term": "JANコード",
    "meaning": "商品に付いているバーコードの、日本における標準規格",
    "detail": "レジで「ピッ」とするあのバーコードのことやね。どの国のどのメーカーのどの商品かを数字で表してるんやわ。\nこれがあるから、世界中のどこで売っても正しく商品が識別できるんやね。\n身近な例やと、コンビニの商品の裏側を見てみて。13桁（または8桁）の数字が並んでるのがJANコードやわ。\nちなみに、世界的には「EANコード」と呼ばれていて、中身は同じルールなんやで。\n試験では、POSシステム（レジの管理）とセットで、商品の識別に使われるものとして覚えておいてな！",
    "categoryId": "STRATEGY.BUSINESS_INDUSTRY",
    "tags": ["バーコード", "流通", "POSシステム", "識別番号"]
  },
{
    "id": 63,
    "term": "DevOps",
    "meaning": "開発（Development）と運用（Operations）が協力し、価値を素早く提供する仕組み",
    "detail": "「作る人」と「守る人」が仲良く協力して、どんどん新しい機能をユーザーに届けようっていう文化のことやね。\n身近な例やと、文化祭の準備（開発）と当日の運営（運用）がバラバラにならずに、連携して盛り上げていくようなもんやわ。\n試験では「開発と運用の連携」「価値の提供速度を高める」というニュアンスを掴んでおけばバッチリや！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["デブオプス", "自動化", "継続的改善"]
  },
  {
    "id": 64,
    "term": "GPL",
    "meaning": "OSSを利用・再配布する際に守らなあかんルールのこと",
    "detail": "「自由に使ってええけど、このルールだけは守ってな」っていう約束事やね。\n代表的な「GPL」は、それを元に作ったソフトもOSSとして公開しなさい、というルール（コピーレフト）があるんやわ。\n他には、著作権表示さえすれば比較的自由な「BSDライセンス」や「MITライセンス」もあるで。\n試験では、OSSは「何をやっても自由」なわけじゃなくて、ライセンスごとにルールがある点に注意してな！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["GPL", "BSD", "MIT", "著作権"]
  },
  {
    "id": 65,
    "term": "サイトライセンス",
    "meaning": "特定の学校や企業内であれば、複数の端末でソフトを使える契約方式",
    "detail": "パソコン1台ごとに契約するんじゃなくて、「この建物の中なら何台でもインストールしてOK」というまとめ買いプランやね。\n企業や学校みたいに、たくさんの人が同じソフトを使う場所では、管理が楽になるしコストも抑えられるんやわ。\n身近な例やと、学校のパソコン室にあるソフトなんかは、この方式で契約されてることが多いで。\n試験では「特定の場所や組織内での利用を認める契約」というニュアンスを掴んでおけばバッチリや！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["ソフトウェア契約", "一括導入", "ボリュームライセンス", "不正コピー防止"]
  },
  {
    "id": 66,
    "term": "コンプライアンス",
    "meaning": "法令遵守。法律だけでなく、社会的なルールや倫理を守ること",
    "detail": "「法律に書いてないから何してもええ」じゃなくて、世の中の常識や企業のモラルに従って行動しようっていう考え方やね。\nITの世界やと、個人情報の流出や、SNSでの不適切な投稿、著作権の侵害なんかが大きな問題になるわ。\n試験では「法令だけでなく、社内規程や企業倫理を守ること」という広い意味で捉えておいてな！",
    "categoryId": "STRATEGY.LEGAL",
    "tags": ["法令遵守", "企業倫理", "社会的責任"]
  },
  {
    "id": 67,
    "term": "コーポレートガバナンス",
    "meaning": "企業統治。株主などが経営者の暴走を防ぎ、正しく運営させる仕組み",
    "detail": "会社が社長や役員のものじゃなくて、社会や株主のために正しく動いているかをチェックする仕組みのことやね。\n「ちゃんと利益を出してるか？」「不正をしてないか？」を監視することで、企業の価値を高めていくんやわ。\n試験では「企業経営を監視する仕組み」というキーワードと、次のITガバナンスとの違いを意識してな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["企業統治", "株主", "経営監視"]
  },
  {
    "id": 68,
    "term": "ITガバナンス",
    "meaning": "経営陣がITを正しく活用し、会社をより良くするための統治を行うこと",
    "detail": "さっきのコーポレートガバナンスのIT版やね。ITを単なる道具じゃなくて、経営戦略の柱としてどう使うかを管理することやわ。\n「このIT投資は本当に儲けに繋がるんか？」「セキュリティは万全か？」と経営者が主体的に考えるんやね。\n試験では「経営方針に基づき、IT戦略を策定し管理する仕組み」という文脈でよく出るで！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["IT戦略", "投資対効果", "リスク管理"]
  },
  {
    "id": 69,
    "term": "KGI",
    "meaning": "重要目標達成指標。ビジネスの最終的な目標を数値で表したもの",
    "detail": "「このプロジェクトが成功したと言えるゴールは何？」を数字にしたものやね。\n例えば「売上を1億円にする」とか「合格率を80%にする」といった、最終的な着地点のことやわ。\n試験では「最終的な目標」というキーワードが出たら、このKGIやと思ってな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["目標設定", "経営戦略", "評価指標"]
  },
  {
    "id": 70,
    "term": "KPI",
    "meaning": "重要業績評価指標。KGIを達成するための、途中のプロセスを確認する指標",
    "detail": "最終目標（KGI）に向かって、正しく進んでいるかを測るための「チェックポイント」やね。\n売上1億円がKGIなら、そのための「新規客数1,000人」とか「成約率10%」といった具体的な数字がKPIになるんやわ。\n試験では、KGIに向かうための「プロセスの評価指標」としてセットで覚えておいて！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["業績評価", "モニタリング", "プロセス管理"]
  },
  {
    "id": 71,
    "term": "BCP",
    "meaning": "事業継続計画。災害などのトラブル時に、事業を止めない（すぐ再開する）ための計画",
    "detail": "地震や火災、テロなどの緊急事態が起きても、重要な仕事を止めへんように準備しておく作戦のことやね。\n「どのデータから復旧させるか」「代わりのオフィスはどこにするか」などをあらかじめ決めておくんやわ。\n試験では「災害時などの事業継続」というフレーズが出てきたら、このBCPを即答やで！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT",
    "tags": ["事業継続", "リスクマネジメント", "災害対策"]
  },
  {
    "id": 72,
    "term": "DNS",
    "meaning": "ドメイン名とIPアドレスを対応させる仕組み（名前解決）",
    "detail": "人間が覚えやすい「google.com」のような住所を、コンピュータが理解できる「142.250.xxx.xxx」みたいな数字の住所に変換してくれる電話帳のようなサービスやね。\nこれが止まると、URLを入力してもサイトに辿り着けなくなるんやわ。\n試験では「ドメイン名とIPアドレスを紐付ける」という役割が絶対に出るから確実に押さえてな！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["名前解決", "ドメイン名", "IPアドレス", "UDP"]
  },
  {
    "id": 73,
    "term": "DHCP",
    "meaning": "ネットワークに接続する機器に、IPアドレスを自動的に割り当てるプロトコル",
    "detail": "スマホやPCをWi-Fiに繋いだとき、自分で数字を打ち込まなくてもネットができるのは、このDHCPサーバーが「空いてる住所（IPアドレス）」を自動で貸してくれるからなんやわ。\n使い終わって切断したら、その住所はまた別の機器に使い回される仕組みやね。\n試験では「IPアドレスの自動割り当て」というフレーズとセットで覚えておいて！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["自動設定", "IPアドレス管理", "LAN"]
  },
  {
    "id": 74,
    "term": "HTTP / HTTPS",
    "meaning": "WebブラウザとWebサーバの間でデータをやり取りするためのプロトコル",
    "detail": "Webサイトを見るための共通ルールやね。末尾に「S」がついたHTTPSは、通信が暗号化されていて安全（Secure）っていう意味やわ。\n今は個人情報を守るために、ほとんどのサイトがHTTPSを使っているんやで。\n試験では、HTTPSが「SSL/TLS」という技術で通信を暗号化していることも合わせて狙われるから要注意や！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["Web通信", "暗号化", "SSL/TLS", "ポート番号"]
  },
  {
    "id": 75,
    "term": "ROI",
    "meaning": "投資利益率。投資した費用に対して、どれだけの利益が得られたかの割合",
    "detail": "「出したお金に対して、どれくらい儲かったか」を測る、投資の効率性を表す指標やね。\n計算式は「利益 ÷ 投資額 × 100」で、この数字が高いほど「効率の良い投資」と言えるんやわ。\n試験では「投資額に対する利益の割合」という定義がストレートに問われるで！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["投資効率", "費用対効果", "経営分析"]
  },
  {
    "id": 76,
    "term": "TCO",
    "meaning": "総所有コスト。導入費用だけでなく、維持・管理、廃棄までにかかる全費用のこと",
    "detail": "システムを買う時の代金（初期費用）だけやなくて、使っている間の電気代、修理代、サポート代、最後に見捨てる時の費用まで全部ひっくるめたコストのことやわ。\n「安物買いの銭失い」になってへんかチェックするために大事な考え方やね。\n試験では「導入から廃棄までの総コスト」というキーワードをしっかりマークしてな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["ライフサイクルコスト", "運用管理", "維持費"]
  },
  {
    "id": 77,
    "term": "ROE",
    "meaning": "自己資本利益率。株主が預けたお金（自己資本）を使って、どれだけ効率よく利益を出したか",
    "detail": "会社が「株主のお金」をどれだけ上手に運用して稼いでいるかを表す、投資家が最も注目する指標の一つやわ。\nROEが高い会社は、それだけ経営の効率が良いと評価されるんやね。\n試験では「自己資本に対する当期純利益の割合」という言葉で出てくるから、ROI（投資全般）としっかり区別してな！",
    "categoryId": "STRATEGY.CORPORATE_ACTIVITY",
    "tags": ["自己資本", "経営指標", "株主資本"]
  },
  {
    "id": 78,
    "term": "DFD",
    "meaning": "データフロー図。業務の中で「データの流れ」を四角や矢印で図解したもの",
    "detail": "「どこからデータが入ってきて、どこで処理され、どこに保存されるか」という流れに注目した図やね。\n業務のルールを整理するのにめちゃくちゃ便利なんやわ。\n試験では「データの流れを視覚化したもの」という特徴と、登場人物（源泉/吸収）、処理、データストア、データフローの4つの記号が狙われるで！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["データフロー図", "業務分析", "構造化分析"]
  },
  {
    "id": 79,
    "term": "E-R図",
    "meaning": "実体（Entity）と、その間の関連（Relationship）を図にしたもの",
    "detail": "データベースの設計をする時に使う図やね。「学生」と「講座」という実体があって、その間に「受講する」という関係がある、みたいなことを整理するんやわ。\nリレーショナルデータベースを作る前の「設計図」の役割を果たすんやね。\n試験では「データ間の関係を表現する」というキーワードとセットで覚えといてな！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["実体関連図", "データベース設計", "リレーション"]
  },
  {
    "id": 80,
    "term": "BPMN",
    "meaning": "ビジネスプロセスモデリング表記。業務の流れを標準化された図で表すもの",
    "detail": "DFDよりももっと細かく、誰が、いつ、どんな判断をして、どの作業をやるかという「手順」を世界共通のルールで描く手法やわ。\nこれを使うと、社内の人だけじゃなく、外部の人とも「今の仕事のやり方」を正確に共有できるんやね。\n試験では「業務プロセスを記述するための標準的な表記法」というフレーズをチェックやで！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["業務プロセス", "モデリング", "標準化"]
  },
  {
    "id": 81,
    "term": "XML",
    "meaning": "タグを使ってデータの意味や構造を記述する言語",
    "detail": "<氏名>山田太郎</氏名>のように、自分で決めた「タグ」でデータを囲むのが特徴やね。\nインターネット上でデータを交換するための標準的な形式として広く普及しているんやわ。\n試験では「独自のタグを定義できる」「データの構造化に向いている」というポイントがよく出るで！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["マークアップ言語", "データ交換", "タグ"]
  },
  {
    "id": 82,
    "term": "JSON",
    "meaning": "JavaScriptの書き方をベースにした、軽量なデータ記述形式",
    "detail": "XMLよりも書き方がシンプルで、データ量が少なくて済むのがええところやね。\n最近のWebアプリやスマホアプリのデータのやり取りでは、このJSONが主流になってるんやわ。\n試験では「XMLに比べてデータ量が少ない（軽量）」「JavaScriptとの相性が良い」という特徴をセットで押さえといてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["データフォーマット", "JavaScript", "軽量"]
  },
  {
    "id": 83,
    "term": "CSV",
    "meaning": "データをカンマ（,）で区切って並べたシンプルなファイル形式",
    "detail": "特別な装飾は一切なしで、データだけを並べた形式やね。Excelなどの表計算ソフトやデータベースとの相性が抜群やわ。\nどんなソフトでも読み込める「互換性」の高さが最大の武器やね。\n試験では「項目をカンマで区切る」「テキスト形式なので汎用性が高い」という点をしっかり覚えておいてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["テキストファイル", "カンマ区切り", "汎用性"]
  },
  {
    "id": 84,
    "term": "サブスクリプション",
    "meaning": "モノを買うのではなく、期間に応じて料金を払って利用するサービス",
    "detail": "略して「サブスク」やね。1個ずつお金を払うんじゃなくて、「月額◯円で使い放題！」っていうスタイルやわ。\n身近な例やと、Apple MusicやSpotify、Netflixなんかがまさにこれやね。昔はCDやDVDを1枚ずつ買ってたけど、今は「利用する権利」にお金を払ってるんやわ。\n試験では「期間に対して対価を支払う方式」というポイントをしっかり押さえといてな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["定額制", "ストック型ビジネス", "サービス利用"]
  },
  {
    "id": 85,
    "term": "シェアリングエコノミー",
    "meaning": "個人や企業が持っている「余っているモノやスキル」を貸し借りする仕組み",
    "detail": "みんなで「分かち合う（シェア）」経済のことやね。使ってない部屋、車、服、あるいは自分の得意なことなんかを、ネットを通じて必要としている人に貸し出すんやわ。\n身近な例やと、空き部屋を貸し出す「Airbnb」や、自転車をみんなで使う「シェアサイクル」なんかが有名やね。\n試験では「遊休資産（余っている資産）の有効活用」という言葉が出てきたら、これのことやと思ってな！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["共有経済", "CtoC", "マッチング"]
  },
  {
    "id": 86,
    "term": "クラウドファンディング",
    "meaning": "インターネットを通じて、不特定多数の人からプロジェクトの資金を集める仕組み",
    "detail": "「こんな面白いものを作りたい！」「困ってる人を助けたい！」という夢に共感した人たちが、少額ずつお金を出して応援することやね。\n略して「クラファン」。身近な例やと、アニメの続編制作や、新しい便利グッズの開発資金をネットで募ってるのをよく見かけるやろ？\n試験では「群衆（Crowd）」から「資金調達（Funding）」するという言葉の意味をイメージすればバッチリや！",
    "categoryId": "STRATEGY.BUSINESS_STRATEGY",
    "tags": ["資金調達", "ソーシャルファンディング", "寄付型・購入型"]
  },
  {
    "id": 87,
    "term": "ハッシュ関数",
    "meaning": "入力したデータを、適当な長さのバラバラな値（ハッシュ値）に変換する計算式",
    "detail": "一度ハッシュ値に変えたら、元のデータには絶対に戻せない「一方通行」の計算やね。\n身近な例で言うと、食材を「ミキサー」にかけるようなもんやわ。イチゴをミキサーにかけたら赤いジュースになるけど、そのジュースから元のイチゴの形には戻されへんやろ？\nパスワードをそのまま保存せずにハッシュ値にしておけば、万が一盗まれても犯人は元のパスワードが分からんから安全なんやで。\n試験では「不可逆性（戻せないこと）」という言葉がよく出るから覚えといて！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["ハッシュ値", "改ざん検知", "一方通行", "MD5/SHA-256"]
  },
  {
    "id": 88,
    "term": "デジタル署名",
    "meaning": "送信者が本人であることと、データが改ざんされていないことを証明する技術",
    "detail": "ネット上の「ハンコ」や「サイン」のことやね。さっきの「ハッシュ関数」と「公開鍵暗号」を組み合わせて使うんやわ。\n身近な例やと、高級なブランド品に付いてる「本物の証（鑑定書）」みたいなもんやね。これがあるから、途中で誰かに中身をすり替えられてもすぐにバレるんやわ。\n試験では「なりすまし」と「改ざん」を防ぐためのもの、という目的をセットで押さえとこな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["公開鍵暗号方式", "真正性", "改ざん検知", "PKI"]
  },
  {
    "id": 89,
    "term": "PKI",
    "meaning": "公開鍵基盤。公開鍵が本物であることを第三者が証明する仕組み",
    "detail": "「この公開鍵は確かに〇〇さんのものです」って保証してくれる、ネット上の「役所」みたいな仕組みやね。\n身近な例やと、ネットショッピングをする時にブラウザに出る「鍵マーク」がこれのおかげやわ。認証局（CA）っていう信頼できる機関がデジタル証明書を発行してくれるんやで。\n試験では、信頼できる第三者機関（CA）が登場するのがポイントやから、そこを意識して覚えてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["認証局", "デジタル証明書", "信頼性", "暗号化"]
  },
  {
    "id": 90,
    "term": "AI",
    "meaning": "人工知能。コンピュータに人間のような知的な活動をさせる技術の総称",
    "detail": "「人間みたいに考えたり、判断したりするプログラム」のことやね。\n身近な例やと、お掃除ロボットが部屋の形を覚えたり、スマホのカメラが人の顔を見つけたりするのもAIの力やわ。\n試験では、特定の仕事だけする「特化型AI」と、人間みたいに何でもできる「汎用型AI」の違いなんかも狙われるで！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["人工知能", "機械学習", "自動化"]
  },
{
    "id": 91,
    "term": "SSD",
    "meaning": "フラッシュメモリを使った、高速で衝撃に強い保存装置",
    "detail": "今のスマホや最新ノートPCの主流やね。動く部品がないから静かやし、何よりデータの読み書きがめちゃくちゃ速いんやわ。\n身近な例やと、ゲーム機のPS5なんかにも使われていて、ロード時間が一瞬なのはこのSSDのおかげやね。\n試験では「読み書きが高速」「衝撃に強い」「消費電力が少ない」というメリットをしっかり押さえといてな！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["ストレージ", "フラッシュメモリ", "高速"]
  },
  {
    "id": 92,
    "term": "HDD",
    "meaning": "磁気ディスクを回転させてデータを読み書きする保存装置",
    "detail": "昔からある「ハードディスク」のことやね。中にレコードみたいな円盤が入ってて、それを回して記録するんやわ。\nSSDに比べると遅いし衝撃にも弱いけど、安くて大量のデータを保存できるのがええところやね。\n身近な例やと、テレビの録画用外付けハードディスクなんかでよく使われてるわ。\n試験では「大容量で安価」という特徴と、物理的に回転する部品があるから衝撃に弱い、という点を覚えとこな！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["磁気ディスク", "ストレージ", "大容量"]
  },
  {
    "id": 93,
    "term": "ROM",
    "meaning": "読み出し専用の記憶装置。電源を切っても内容が消えないのが特徴",
    "detail": "さっきのRAM（電源で消える）の反対で、一度書き込んだら消えへん「不揮発性」のメモリやね。\n身近な例やと、ゲーム機の「カセット」や、家電を動かすための「最初から入ってるプログラム」なんかがこれやわ。\n最近は書き換えができるタイプも多いけど、基本は「電源を切っても消えない」っていうのが最大のポイントやで！\n試験では、RAM（揮発性）とROM（不揮発性）の違いがド定番やから、絶対に混同せんようにしてな！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["不揮発性", "読み出し専用", "メモリ"]
  },
{
    "id": 94,
    "term": "ホワイトボックステスト",
    "meaning": "プログラムの内部構造（プログラムの中身）が正しく動くかを確認するテスト",
    "detail": "中身が「白（ホワイト）」で見える状態で、全ての命令やルートを通るかチェックするやり方やね。\n高校の数学で言うと、答えだけじゃなくて「途中の計算式が合ってるか」を細かく添削してもらう感じやわ。\n試験では「内部構造に着目する」というキーワードをしっかり押さえてな！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["テスト手法", "単体テスト", "網羅性"]
  },
  {
    "id": 95,
    "term": "ブラックボックステスト",
    "meaning": "中身は見ずに、入力に対して正しい出力（結果）が出るかを確認するテスト",
    "detail": "中身が「黒（ブラック）」で見えない箱だと思って、外からの動きだけを見るやり方やね。\n身近な例やと、自販機にお金を入れてボタンを押したら、ちゃんとお茶が出てくるか確認するようなもんやわ。中の機械がどう動いてるかは気にせえへんやろ？\n試験では「内部構造を意識せず、入力と出力の関係を確認する」というフレーズがド定番やで！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["テスト手法", "機能テスト", "仕様書"]
  },
  {
    "id": 96,
    "term": "回帰テスト（リグレッションテスト）",
    "meaning": "システムを修正したときに、他の正常だった部分に悪影響が出ていないかを確認するテスト",
    "detail": "「あっちを直したら、こっちが壊れた！」っていうのを防ぐためのテストやね。\n身近な例やと、自転車のパンクを直した後に、ブレーキがちゃんと効くか、ライトが消えてへんか、念のために全体を確認するようなもんやわ。\n試験では「修正によって新たなバグが発生していないかを確認する」というニュアンスを掴んどいてな！",
    "categoryId": "MANAGEMENT.SYSTEM_DEV_TECH",
    "tags": ["リグレッションテスト", "品質保証", "デバッグ"]
  },
{
    "id": 97,
    "term": "PMBOK",
    "meaning": "プロジェクトマネジメントの知識を体系化した世界標準のガイドブック",
    "detail": "「プロジェクトを成功させるためには、こういう手順で管理したらええで！」っていうノウハウをまとめたルールブックやね。\n身近な例やと、文化祭の出し物（プロジェクト）を成功させるための「最強の運営マニュアル」みたいなもんやわ。\n試験では「プロジェクトマネジメントの知識体系」というキーワードでよく出るから、名前をしっかり覚えといてな！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT",
    "tags": ["ガイドライン", "世界標準", "知識体系"]
  },
  {
    "id": 98,
    "term": "WBS",
    "meaning": "プロジェクトで必要な作業を細かく分解して、階層構造で図解したもの",
    "detail": "大きな目標を「今やるべき小さな作業」にバラバラにする手法やね。\n例えば「夏休みの宿題を終わらせる」という目標を、「数学のワークを5ページやる」「読書感想文の構成を考える」みたいに細かく分けて書き出す感じやわ。\nこれを作ると、作業の抜け漏れがなくなるし、誰が何をやるかハッキリするんやね。\n試験では「作業を細分化した図」というニュアンスを掴んでおけばバッチリや！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT",
    "tags": ["作業分解構成図", "計画策定", "進捗管理"]
  },
  {
    "id": 99,
    "term": "USB",
    "meaning": "パソコンと周辺機器を接続するための、最も一般的なシリアルインターフェース",
    "detail": "マウス、キーボード、USBメモリ、スマホの充電など、何でもつなげる万能な端子やね。\n「プラグアンドプレイ」という機能があって、差し込むだけで設定なしですぐ使えるのが特徴やわ。\n身近な例やと、最近は上下どっちでも刺せる「Type-C」が主流になってきてるよな。あれもUSBの規格の一つやね。\n試験では「周辺機器を接続する標準的な規格」という点と、電源を入れたまま抜き差しできる「ホットプラグ」という言葉もセットで覚えとこう！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["インターフェース", "Type-C", "プラグアンドプレイ", "ホットプラグ"]
  },
  {
    "id": 100,
    "term": "Bluetooth",
    "meaning": "数メートル程度の短い距離で、デジタル機器同士をつなぐ無線通信規格",
    "detail": "ワイヤレスイヤホンやマウスを、ケーブルなしでつなぐための技術やね。\n赤外線通信とは違って、壁などの障害物があっても、近くにいれば通信できるのがええところやわ。\n身近な例やと、電車のなかで音楽を聴くときに使ってるその通信、まさにこれやね。消費電力が少ないのも大きなメリットやわ。\n試験では「短距離の無線通信」というキーワードを見つけたらBluetoothやと思って間違いなしや！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["無線通信", "2.4GHz帯", "ペアリング", "PAN"]
  },
  {
    "id": 101,
    "term": "HDMI",
    "meaning": "映像と音声を、1本のケーブルでまとめて送ることができるデジタルインターフェース",
    "detail": "テレビとゲーム機（SwitchやPS5）をつないだり、PCをモニターにつないだりするときに使う端子やね。\n昔は映像用と音声用で何本もケーブルが必要やったけど、今はこれ1本で高画質・高音質が送れるんやわ。\n身近な例やと、学校のプロジェクターに先生がパソコンをつなぐときも、このHDMIがよく使われてるはずやで。\n試験では「映像と音声を1本のケーブルで送るデジタル規格」というフレーズをしっかりマークしてな！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["映像出力", "デジタル信号", "マルチメディア"]
  },
  {
    "id": 102,
    "term": "OS",
    "meaning": "基本ソフトウェア。ハードウェアとアプリを管理し、人間が使いやすくするソフト",
    "detail": "コンピュータ全体の「管理人さん」やね。キーボードが押されたことをアプリに伝えたり、データをSSDに保存したりする仕事を一手に引き受けてるんやわ。\n身近な例やと、Windows、macOS、iOS、Android、あとサーバーでよく使われるLinuxなんかが有名やね。\n試験では、OSがあるおかげで「アプリはハードウェアの違いを意識せずに動かせる」という点が大事なポイントやで！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["オペレーティングシステム", "Windows", "iOS", "基本ソフト"]
  },
  {
    "id": 103,
    "term": "デバイスドライバ",
    "meaning": "OSが周辺機器（ハードウェア）を操作するための専用ソフト",
    "detail": "OSと周辺機器の間をつなぐ「通訳さん」のことやね。プリンタやマウスを新しくつないだ時、OSがその動かし方を理解できるように導入されるんやわ。\n身近な例やと、最近はUSBを刺すだけで勝手に入る（プラグアンドプレイ）ことが多いけど、裏ではこの通訳さんが大急ぎで準備してくれてるんやで。\n試験では「OSとハードウェアの仲立ちをするソフトウェア」というフレーズを覚えておこう！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["周辺機器", "制御ソフト", "プラグアンドプレイ"]
  },
  {
    "id": 104,
    "term": "アローダイアグラム",
    "meaning": "作業の順番と、完了までにかかる日数を矢印でつないだ図（別名：PERT図）",
    "detail": "「どの作業が終わらないと、次の作業に進めないか」をパッと見て分かるようにした図やね。\n身近な例やと、カレー作りで「野菜を切る」のと「お米を炊く」のを同時に始めて、どっちが遅れると全体の完成が遅れるか計算するようなもんやわ。\n試験では、一番時間がかかるルート（クリティカルパス）を見つける計算問題としてよく出るから、形に慣れとこな！",
    "categoryId": "MANAGEMENT.PROJECT_MGMT",
    "tags": ["PERT図", "工程管理", "クリティカルパス"]
  },
  {
    "id": 107,
    "term": "ライブマイグレーション",
    "meaning": "仮想サーバーを動かしたまま、別の物理サーバーへ移動させる技術",
    "detail": "さっきの「仮想的なパソコン」を、システムを止めることなく、別の土台（機械）へ引っ越しさせることやね。\n身近な例やと、電車が走りながら、中のお客さんを乗せたまま別の線路へ車両ごとスッと移し替えるような、神業みたいな技術やわ。\nこれができると、機械のメンテナンスをするときもサービスを止めなくて済むんやね。\n試験では「稼働させたまま移動させる」というフレーズが狙い目やで！",
    "categoryId": "TECHNOLOGY.COMPUTER_SYSTEM",
    "tags": ["可用性", "サーバー移行", "システム停止なし"]
  },
  {
    "id": 108,
    "term": "ITIL",
    "meaning": "ITサービスマネジメントの成功事例（ベストプラクティス）をまとめた本",
    "detail": "世界中のITのプロたちが「こうやって運用したら上手くいったで！」っていう経験談をまとめた、いわば「運用のバイブル」やね。\n身近な例やと、部活動の伝統をまとめた「引継ぎノート」のめっちゃ豪華なやつ、みたいなもんやわ。\n試験では「ITサービスマネジメントのベストプラクティス」という言葉がそのまま出ることが多いから、セットで覚えとこう！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT",
    "tags": ["運用管理", "ベストプラクティス", "サービスマネジメント"]
  },
  {
    "id": 109,
    "term": "エスカレーション",
    "meaning": "自分たちだけで解決できない問題を、より詳しい部署や上司に引き継ぐこと",
    "detail": "サポートセンターに電話して「私では分からないので、担当の者に代わります」って言われる、あの流れのことやね。\n身近な例やと、勉強で分からんところを友達に聞いて、それでも分からんから先生に聞きに行く、みたいなステップアップのことやわ。\n試験では「上位の組織や管理者に連絡・対応を依頼する」というニュアンスで出てくるで！",
    "categoryId": "MANAGEMENT.SERVICE_MGMT",
    "tags": ["問題解決", "インシデント管理", "対応フロー"]
  },
{
    "id": 110,
    "term": "フィッシング",
    "meaning": "偽のメールやWebサイトを使って、パスワードやカード情報を盗む詐欺",
    "detail": "「魚釣り（Fishing）」みたいに、エサを撒いて獲物を釣るからこの名前がついたんやわ。\n身近な例やと、Amazonや銀行を名乗るメールが届いて、「アカウントが停止されました。こちらからログインして確認してください」って偽サイトに誘導されるやつやね。\n試験では「実在する企業を装った偽サイト」「個人情報を盗む」という言葉がキーワードや！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["詐欺", "なりすまし", "ソーシャルエンジニアリング"]
  },
  {
    "id": 111,
    "term": "ランサムウェア",
    "meaning": "身代金（Ransom）要求型ウイルス。勝手にデータを暗号化して、戻すためにお金を要求する",
    "detail": "パソコンの中身を勝手に「人質」に取って、「お金を払わなデータを消すで！」って脅してくる悪いソフトやね。\n身近な例やと、自分のスマホが突然ロックされて、「解除したければプリペイドカードで3万円分払え」って表示されるようなもんやわ。払っても戻ってこないことが多いからタチが悪いんや。\n試験では「身代金を要求する不正プログラム」という特徴を絶対に覚えとこな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["マルウェア", "身代金", "暗号化"]
  },
  {
    "id": 112,
    "term": "DoS攻撃 / DDoS攻撃",
    "meaning": "ターゲットのサーバーに大量のデータを送りつけて、パンクさせて使えなくする攻撃",
    "detail": "「サービス拒否攻撃」とも言うわ。1台で攻撃するのがDoS、たくさんのPCから一斉に攻撃するのがDDoSやね。\n身近な例やと、お店の入り口に何千人もサクラが押し寄せて、本当のお客さんが一人も入れなくなるような嫌がらせやわ。\n試験では「大量のパケットやデータを送る」「サービスの妨害」というフレーズが目印やで！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["サービス妨害", "ボットネット", "踏み台"]
  },
  {
    "id": 113,
    "term": "ファイアウォール",
    "meaning": "ネットワークの境界に設置して、不正な通信を通さないようにする仕組み",
    "detail": "名前の通り「防火壁」やね。あらかじめ決めたルールに従って、怪しい通信は通さず、正しい通信だけを通す「ネットの門番」やわ。\n身近な例やと、マンションのオートロックみたいなもんやね。鍵（許可されたルール）を持ってる人だけが中に入れるんやわ。\n試験では「外部ネットワークからの不正アクセスを防ぐ」という役割をしっかり押さえといてな！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["パケットフィルタリング", "境界防御", "ポート制限"]
  },
  {
    "id": 114,
    "term": "IDS / IPS",
    "meaning": "不正侵入検知システム（IDS）と、不正侵入防止システム（IPS）",
    "detail": "ファイアウォールが門番なら、こっちは「監視カメラ」と「警備員」やね。\nIDSは怪しい動きを見つけたら知らせてくれる（検知）だけで、IPSはさらにその場で攻撃を止めてくれる（防止）んやわ。\n身近な例やと、お店の万引き防止センサーがIDSで、それを見つけた警備員がその場で捕まえるのがIPSやね。\n試験では「検知（Detection）」と「防止（Prevention）」の違いをアルファベットの真ん中の文字で覚えとくと楽やで！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["侵入検知", "侵入防止", "シグネチャ"]
  },
  {
    "id": 115,
    "term": "WAF",
    "meaning": "Webアプリケーションファイアウォール。Webサイトへの攻撃に特化した防御装置",
    "detail": "普通のファイアウォールより、もっと細かく「Webサイトの中身」をチェックするガードマンやね。\n身近な例やと、さっきのオートロックを抜けた後に、各部屋の入り口にいる「さらに厳しい荷物検査員」みたいなもんやわ。ネットショッピングのサイトなんかを狙った攻撃を防いでくれるんや。\n試験では「Webアプリケーションへの攻撃を防ぐ」という言葉が出たらWAFを選べば正解や！",
    "categoryId": "TECHNOLOGY.SECURITY",
    "tags": ["Webセキュリティ", "SQLインジェクション対策", "XSS対策"]
  },
  {
    "id": 116,
    "term": "著作権法",
    "meaning": "文章、音楽、絵、プログラムなどの「作った人の権利」を守る法律",
    "detail": "自分が苦労して作ったものを、勝手にコピーされたりネットにアップされたりせえへんためのルールやね。\n身近な例やと、友達が描いたイラストを勝手にSNSのアイコンにしたり、有料のソフトをタダで配ったりするのは、この法律に引っかかるんやわ。\n試験では「プログラムやデータベースも著作物に含まれる」ことと、「アルゴリズム（やり方）自体には著作権がない」っていうひっかけポイントがよく出るで！",
    "categoryId": "STRATEGY.LEGAL_AFFAIRS",
    "tags": ["知的財産権", "プログラム", "権利保護"]
  },
  {
    "id": 117,
    "term": "不正アクセス禁止法",
    "meaning": "他人のID・パスワードを勝手に使ったり、セキュリティの穴を突いて侵入したりすることを禁じる法律",
    "detail": "ネット上の「不法侵入」を取り締まるルールやね。\n身近な例やと、友達のスマホのパスワードを盗み見て勝手にSNSを覗いたり、他人のアカウントにログインしたりするだけでアウトなんやわ。実際に何かを盗まなくても「入るだけ」で犯罪になるんやで。\n試験では「他人の識別符号（ID・パスワード）の無断入力」という言葉をマークしてな！",
    "categoryId": "STRATEGY.LEGAL_AFFAIRS",
    "tags": ["サイバー犯罪", "アクセス制御", "情報保護"]
  },
  {
    "id": 118,
    "term": "労働者派遣法",
    "meaning": "派遣会社に雇われている人が、派遣先の指示で働くときのルールを決めた法律",
    "detail": "IT業界は派遣で働く人も多いから、試験に出るんやわ。\n大事なのは「誰が給料を払って、誰が命令を出すか」やね。派遣は「給料は派遣元から、命令は派遣先から」という特殊な形なんやわ。\n身近な例やと、塾の先生が「派遣会社」から「別の教室」に送られて、その教室の校長先生の指示で授業をするようなもんやね。\n試験では、これと似た「請負（命令も自分の会社から）」との違いが絶対に出るから要注意や！",
    "categoryId": "STRATEGY.LEGAL_AFFAIRS",
    "tags": ["雇用形態", "指揮命令", "派遣・請負"]
  }
]