[
  {
    "id": 1,
    "term": "GUI（グラフィカル・ユーザ・インターフェース）",
    "meaning": "アイコンやマウスを使って、視覚的に直感的な操作ができる仕組み",
    "detail": "コンピュータの操作を、文字ではなく図や画像で分かりやすくした画面構成のこと。\n難しい命令文を覚えなくても、画面を見てマウスや指で操作できるのが最大の特徴。\nスマホのホーム画面に並んでいるアイコンをタップするのも、まさにGUIなんやね。\nこれのおかげで、専門知識がない人でも簡単にIT機器を使いこなせるようになったわけ。\n試験では、文字だけで操作する「CUI」という用語とセットで出題されるから注意して！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["インターフェース", "CUI", "アイコン", "ユーザビリティ"]
  },
  {
    "id": 2,
    "term": "プラグアンドプレイ",
    "meaning": "周辺機器を接続すると、OSが自動で設定を行ってくれる機能",
    "detail": "新しいマウスやキーボードをパソコンに繋いだ瞬間、すぐに使えるようになる便利な仕組みのこと。\nOSが接続を検知して、必要な「デバイスドライバ」を自動的に割り当ててくれるんやわ。\n身近な例で言うと、USBメモリを差し込むだけでファイルが開けるようになるのがこれに当たるね。\n昔はいちいち自分で難しい設定をしていたけれど、今は差し込む（Plug）だけで動く（Play）から本当に楽。\n試験では「自動的にデバイスドライバが組み込まれる機能」というキーワードを確実に押さえておいてな！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["周辺機器", "デバイスドライバ", "USB", "自動設定"]
  },
  {
    "id": 3,
    "term": "OSS（オープンソースソフトウェア）",
    "meaning": "ソースコードが公開されており、誰でも改良や再配布ができるソフトウェア",
    "detail": "ソフトの設計図にあたる「ソースコード」がタダで一般公開されているもののこと。\n誰でも中身を確認できるから、世界中のエンジニアが協力してバグを直したり機能を増やしたりできるんやね。\n具体的な例を挙げると、ブラウザの「Firefox」やサーバー用OSの「Linux」などが有名。\n営利目的での利用も認められているけれど、全くルールがないわけではなく、独自のライセンス（利用規約）がある点には注意が必要。\n試験では、著作権が放棄されているわけではない、というひっかけ問題によく出るから気をつけて！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["Linux", "ソースコード", "ライセンス", "知的財産権"]
  },
  {
    "id": 4,
    "term": "ディレクトリ",
    "meaning": "コンピュータ内でファイルを整理・分類するための「箱」のこと",
    "detail": "WindowsやMacでいうところの「フォルダ」と同じ意味やと思って大丈夫。\nこれを使うことで、大量のデータを「写真」「学校」「遊び」みたいに分けて管理できるんやね。\n身近な例で言うと、机の引き出しの中に「教科書用」や「プリント用」の仕切りを作るのと似てるわ。\n一番上の階層を「ルートディレクトリ」、その中にあるものを「サブディレクトリ」と呼ぶのが一般的。\n試験では、この階層構造（ツリー構造）の仕組みがよく問われるからしっかり理解しといてな！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["フォルダ", "階層構造", "ファイル管理", "ルートディレクトリ"]
  },
  {
    "id": 5,
    "term": "仮想メモリ",
    "meaning": "主記憶装置（メモリ）の容量不足を、補助記憶装置（HDDなど）を使って補う仕組み",
    "detail": "実行したいアプリが多すぎてメモリがいっぱいになったとき、ハードディスクの一部をメモリ代わりにする機能のこと。\nこれがあるおかげで、本来のメモリ容量を超える大きなプログラムも動かすことができるんやわ。\n例えるなら、机の上が勉強道具でいっぱいになったとき、一時的に隣の空いている椅子に教科書を置いて作業スペースを広げるようなもんやね。\nただし、本物のメモリより読み書きのスピードはガクンと落ちてしまうのが弱点。\n試験では「主記憶の容量を補うために、補助記憶の一部を仮想的に利用する」という説明が頻出やで！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["メモリ", "主記憶装置", "補助記憶装置", "ページング"]
  },
  {
    "id": 6,
    "term": "アーカイブ",
    "meaning": "複数のファイルを一つにまとめたり、長期間保存するために専用の場所に保管すること",
    "detail": "バラバラになったデータをひとまとめに整理して、後で取り出しやすいように記録保存することを指すんやね。\n日常的な場面やと、メールを削除せずに「アーカイブ」機能を使って、受信トレイをスッキリさせる使い方がおなじみかも。\nITの世界では、単にまとめるだけでなく、容量を小さくする「圧縮」とセットで行われることが多いわ。\n大事な思い出の写真をアルバムにまとめて本棚にしまう、そんなイメージやな。\n試験では「複数のファイルを一つにまとめること」という基本の意味をまず押さえといて！",
    "categoryId": "TECHNOLOGY.SOFTWARE",
    "tags": ["圧縮", "バックアップ", "整理", "ファイル"]
  },
  {
    "id": 7,
    "term": "CPU（中央処理装置）",
    "meaning": "コンピュータの各装置を制御し、データの演算を行う「頭脳」にあたる部品",
    "detail": "マウスからの入力に反応したり、計算をしたりと、コンピュータのあらゆる命令をさばくパーツのこと。\n性能が良いほど、複雑な処理もサクサクこなせるようになるんやね。\n人間に例えるなら、まさに計算や判断を行う「脳みそ」そのものやわ。\nスマホを選ぶときに「チップ」や「プロセッサ」と呼ばれているのも、このCPUのことやと思えばOK。\n試験では「制御」と「演算」という2つの大きな役割をセットで覚えるのが合格への近道やで！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["プロセッサ", "演算", "制御", "ハードウェア"]
  },
  {
    "id": 8,
    "term": "主記憶装置（メインメモリ）",
    "meaning": "CPUが直接読み書きを行う、実行中のプログラムやデータを一時的に保存する場所",
    "detail": "コンピュータが今まさに使っている情報を置いておくための高速な記憶装置のこと。\n電源を切ると中身が消えてしまう「揮発性」という性質があるんやわ。\nよく例えられるのは「机の広さ」やね。机が広いほど、たくさんの参考書（アプリ）を同時に広げて効率よく勉強（作業）できるわけ。\nスマホのスペック表にある「メモリ 8GB」といった数字がこれに当たるんやで。\n試験では、補助記憶装置（SSDなど）よりも高速やけど、容量あたりの価格が高いという特徴を押さえといてな！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["RAM", "揮発性", "メモリ", "実行メモリ"]
  },
  {
    "id": 9,
    "term": "補助記憶装置",
    "meaning": "プログラムやデータを長期間保存するための装置で、電源を切っても内容が消えないのが特徴",
    "detail": "SSDやHDD（ハードディスク）、USBメモリのように、データをずっと取っておくための場所のこと。\n主記憶装置（メモリ）に入りきらないデータや、今は使わないアプリをしまっておく役割があるんやね。\n例えるなら、机の横にある「本棚」や「引き出し」のようなイメージやわ。\n容量はめちゃくちゃ大きいけれど、CPUが直接データを読み書きできないから、一度メモリに移す必要があるんやで。\n試験では、SSDはHDDに比べて「衝撃に強く、読み書きが速い」というメリットがよく出るから要注意や！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["SSD", "HDD", "ストレージ", "不揮発性"]
  },
  {
    "id": 10,
    "term": "バス",
    "meaning": "コンピュータの各装置間でデータをやり取りするための共通の伝送路",
    "detail": "CPUやメモリ、周辺機器の間を結ぶ「データの通り道」のことやね。\nここが太くて速いほど、一度にたくさんのデータを運べるから、コンピュータ全体のスピードが上がるんやわ。\n身近な例で言うと、道路の「車線数」みたいなもんやな。車線が多いほど、渋滞せずにスムーズに車が流れるやろ？\nCPUの内部で使う「内部バス」と、周辺機器を繋ぐ「外部バス」の種類があるんやで。\n試験では「各装置を結ぶデータの伝送路」という言葉が出てきたら、バスのことやと思って間違いなしや！",
    "categoryId": "TECHNOLOGY.COMPUTER_COMPONENTS",
    "tags": ["伝送路", "データ転送", "内部バス", "外部バス"]
  },
  {
    "id": 11,
    "term": "入力装置",
    "meaning": "人間がコンピュータに対して指示やデータを与えるための装置",
    "detail": "私たちの考えや操作を、デジタルデータに変えてコンピュータに伝えるための道具のこと。\nこれがないと、コンピュータに何をしてほしいか命令を伝えることができへんのやね。\n代表的なのはキーボードやマウス、スマホのタッチパネル、それから音声を拾うマイクなんかもそうやわ。\nゲームで使うコントローラーも、自分の「動かしたい」という意思を伝える立派な入力装置やね。\n試験では、バーコードリーダーやスキャナも入力装置に含まれることをしっかり覚えておいてな！",
    "categoryId": "TECHNOLOGY.HARDWARE",
    "tags": ["キーボード", "マウス", "タッチパネル", "スキャナ"]
  },
  {
    "id": 12,
    "term": "出力装置",
    "meaning": "コンピュータが処理した結果を、人間がわかる形で見せてくれる装置",
    "detail": "コンピュータの中で計算されたデータを、文字や画像、音として私たちに届けてくれる部品のこと。\nこれがあるからこそ、私たちはコンピュータが何を考えているかを知ることができるんやわ。\n身近な例やと、パソコンのモニター（ディスプレイ）や、紙に印刷するプリンタ、音が鳴るスピーカーがこれに当たるね。\n最近やと、VRゴーグルなんかも没入感のある映像を出す高度な出力装置の一つやな。\n試験では、ディスプレイの解像度やプリンタの印刷方式とセットで聞かれることが多いから要注意やで！",
    "categoryId": "TECHNOLOGY.HARDWARE",
    "tags": ["ディスプレイ", "プリンタ", "モニター", "スピーカー"]
  },
  {
    "id": 13,
    "term": "2進数",
    "meaning": "「0」と「1」の2種類の数字だけで全ての数を表現する方法",
    "detail": "コンピュータは電気の「ON（1）」と「OFF（0）」でしか物事を判断できへんから、この数え方を使ってるんやね。\n私たちが普段使っている10進数は「10」で桁が上がるけど、2進数は「2」になったらすぐ次の桁に上がるんやわ。\n身近な例で言うと、電球のスイッチの「入・切」をイメージすると分かりやすいかも。\n最初は戸惑うかもしれんけど、慣れると「0、1、10、11…」とパズル感覚で数えられるようになるで。\n試験では、10進数から2進数への変換問題がよく出るから、計算手順を練習しておくのが合格のポイントや！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["2進法", "10進数", "デジタル", "ビット"]
  },
  {
    "id": 14,
    "term": "ビット（bit）",
    "meaning": "コンピュータが扱う情報の最小単位",
    "detail": "2進数の「0」か「1」のどちらか1つが入る、情報の最小の「箱」のことやね。\n1ビットなら2通り（0か1）、2ビットなら4通り（00, 01, 10, 11）の情報を表せるんやわ。\n例えるなら、YESかNOだけで答える「究極の2択アンケート」1回分が1ビットやと思えばええよ。\nビット数が増えれば増えるほど、一度に表現できる色の数や情報のパターンが増えていくんやね。\n試験では「nビットで $2^n$ 通りの情報を表現できる」という公式をしっかり頭に入れといてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["情報単位", "データ量", "2進数", "最小単位"]
  },
  {
    "id": 15,
    "term": "バイト（Byte）",
    "meaning": "ビットを8個まとめた情報の単位で、1バイト＝8ビット",
    "detail": "「ビット」は細かすぎるから、実務ではこの「バイト」をひと塊として扱うのが一般的やね。\n1バイト（8ビット）あれば、256通りの情報を表せるから、半角の英数字1文字分を表現できるんやわ。\nスマホの通信制限で聞く「GB（ギガバイト）」の「バイト」もこれのこと。おなじみの単位やね。\n1ビットが小銭の1円玉やとしたら、バイトは5円玉…いや、キリよく8円玉という塊があるイメージかな。\n試験では「1Byte = 8bit」という計算は超重要。k（キロ）やM（メガ）といった単位の変換も一緒に覚えといて！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["Byte", "bit", "データ量", "単位変換"]
  },
  {
    "id": 16,
    "term": "単位の接頭語（k, M, G, T）",
    "meaning": "データの大きさを表すために、単位の前に付ける記号",
    "detail": "ビットやバイトだけでは数が大きくなりすぎるから、1000倍（正確には1024倍）ごとに名前を変えていくんやわ。\n小さい順に、k（キロ）、M（メガ）、G（ギガ）、T（テラ）と続いていくんやね。\n身近な例やと、スマホの通信量「5ギガ（5GB）」や、写真1枚のサイズ「3メガ（3MB）」といった言葉で毎日使ってるはず。\n「キロキロと太って（M）メガギガ（G）寺（T）へ」なんて語呂合わせで順番を覚えるのも一つの手やね。\n試験では、それぞれが $10^3$（約1000）倍ずつ増えていく関係をしっかり整理しておいて！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["キロ", "メガ", "ギガ", "テラ", "データ量"]
  },
  {
    "id": 17,
    "term": "文字コード",
    "meaning": "文字一つひとつに割り当てられた固有の数字（ビット列）のルール",
    "detail": "コンピュータは「あ」や「A」という文字をそのまま理解できへんから、数字に変換して処理してるんやね。\n世界中で共通のルールがないと、送ったメールが文字化けして読めなくなってしまうんやわ。\n例えるなら、モールス信号の「ト・ツー」が特定の文字を表すのと似たような仕組みやな。\n代表的なものに、英数字のみの「ASCII」や、世界中の文字を扱える「Unicode（UTF-8）」があるで。\n試験では、世界標準の「Unicode」という名前と、文字化けがなぜ起こるのかという理由をセットで押さえといてな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["ASCII", "Unicode", "UTF-8", "文字化け"]
  },
  {
    "id": 18,
    "term": "フォント",
    "meaning": "コンピュータで表示・印刷される文字のデザイン（書体）",
    "detail": "同じ「あ」という文字でも、角ばっていたり丸まっていたり、色んな見た目があるやろ？\n大きく分けると、文字の端に飾りがある「明朝体」と、太さが一定の「ゴシック体」の2種類が有名やね。\n身近な例やと、学校の課題は「明朝体」、プレゼンのスライドは見やすい「ゴシック体」といった使い分けをしてるはずやわ。\nデータ形式としては、拡大してもギザギザにならない「アウトラインフォント」が今の主流やね。\n試験では、用途に合わせたフォント選びが「情報デザイン」の観点でも大切やってことを覚えておいて！",
    "categoryId": "TECHNOLOGY.INFO_DESIGN",
    "tags": ["明朝体", "ゴシック体", "アウトラインフォント", "ビットマップフォント"]
  },
  {
    "id": 19,
    "term": "アルゴリズム",
    "meaning": "問題を解決するための手順や計算のやり方のこと",
    "detail": "コンピュータに「どういう順番で何をさせるか」という具体的なレシピみたいなもんやね。\n同じ結果を出すにしても、効率の良いアルゴリズムを使えば処理がめちゃくちゃ速くなるんやわ。\n身近な例で言うと、カレーを作る時の「野菜を切る→炒める→煮込む」という手順そのものがアルゴリズムやね。\nこの段取りがバラバラやと、美味しいカレー（正しい結果）は完成せえへんやろ？\n試験では、代表的なアルゴリズムとして「探索（データを探す）」や「整列（並べ替える）」があることを知っておいてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["手順", "プログラム", "フローチャート", "効率化"]
  },
  {
    "id": 20,
    "term": "フローチャート（流れ図）",
    "meaning": "アルゴリズムなどの処理の手順を、図形を使って視覚的に表したもの",
    "detail": "言葉で説明するとややこしい手順を、「〇」や「◇」の記号を使って誰でも分かるように図解したもんやね。\n矢印を辿っていくだけで、次に何をすればいいか一目で分かるから、設計図として使われるんやわ。\n例えるなら、スマホゲームのイベント攻略チャートや、避難訓練の経路図みたいなイメージやな。\n「もしHPが0になったらゲームオーバーへ」といった条件分岐も、ひし形の記号一つでスッキリ表現できるんやで。\n試験では、開始・終了の端子や、判断（ひし形）の記号の意味を問われるから、形と役割を一致させといて！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["アルゴリズム", "図解", "処理手順", "設計図"]
  },
  {
    "id": 21,
    "term": "変数（へんすう）",
    "meaning": "データを入れておくために、プログラムの中で名前を付けた「箱」のこと",
    "detail": "計算結果を一時的に覚えさせたり、ユーザーが入力した文字を保存したりするために使うんやね。\n「score = 100」みたいに書くと、scoreという名前の箱に100という数字が入るイメージやわ。\n身近な例やと、ゲームの「プレイヤー名」や「所持金」がこれに当たるね。中身がどんどん書き換わるから「変」わる「数」なんやわ。\n一度箱に入れてしまえば、後から何度でもその中身を取り出して使うことができるんやで。\n試験では、変数に値を代入する（入れる）という考え方が全てのプログラミング問題の基礎になるから、しっかりマスターしてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["代入", "データ", "プログラミング", "保存"]
  },
  {
    "id": 22,
    "term": "制御構造（三つの基本構造）",
    "meaning": "プログラムの流れを作る「順次」「選択」「繰返し」の3つの形",
    "detail": "どんなに複雑なプログラムも、実はこの3つの組み合わせだけでできているんやわ。\n上から順に進む「順次」、条件で分かれる「選択」、同じことを繰り返す「繰返し」のことやね。\n身近な例やと、自動販売機が分かりやすいわ。「お金を入れる（順次）」→「金額が足りるか確認（選択）」→「お釣りを10円ずつ出す（繰返し）」といった感じやね。\nこの考え方を「構造化プログラミング」って呼んだりもするんやで。\n試験では、フローチャートを見て「これはどの構造かな？」と見分ける問題がよく出るから、パズルを解く感覚で慣れておいてな！",
    "categoryId": "TECHNOLOGY.ALGO_PROGRAMMING",
    "tags": ["順次", "選択", "繰返し", "制御構造"]
  },
  {
    "id": 23,
    "term": "機械学習（マシンラーニング）",
    "meaning": "大量のデータからコンピュータが自らルールやパターンを学び出す仕組み",
    "detail": "人間がいちいち「これは猫の画像やで」とルールを教えなくても、AIが自分で特徴を見つけ出す技術のことやね。\nデータが多ければ多いほど、AIの「目」や「判断」はどんどん正確になっていくんやわ。\n身近な例やと、YouTubeの「おすすめ動画」や、迷惑メールの自動振り分けなんかがこれを利用してるね。\nAIが勝手に賢くなっていくなんて、ちょっと不思議な感じがするやろ？\n試験では、AIを実現するための代表的な手法が「機械学習」である、という点に注目してな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["AI", "人工知能", "ディープラーニング", "ビッグデータ"]
  },
  {
    "id": 24,
    "term": "ディープラーニング（深層学習）",
    "meaning": "人間の脳の神経回路を模したモデルを使い、より高度な判断をさせる機械学習の手法",
    "detail": "機械学習の中でも特にすごいやつで、人間の脳と同じような仕組み（ニューラルネットワーク）を使っているんやわ。\nこれのおかげで、画像認識や翻訳の精度が、人間と変わらないレベルまで一気に上がったんやね。\n身近な例やと、スマホの「顔認証」や、チェスや囲碁でプロに勝つAIなんかがこれの力やわ。\nいわば、AI界のエリート教育みたいなもんやと思えば分かりやすいかな。\n試験では「ニューラルネットワークを多層にしたもの」というフレーズが出てきたら、これのことやと即答してな！",
    "categoryId": "TECHNOLOGY.BASIC_THEORY",
    "tags": ["AI", "ニューラルネットワーク", "画像認識", "機械学習"]
  },
  {
    "id": 25,
    "term": "リレーショナルデータベース（RDB）",
    "meaning": "データを複数の「表（テーブル）」の形式で管理するデータベース",
    "detail": "Excelのシートみたいに、縦の列と横の行でデータを整理する、今最もよく使われている方式やわ。\n複数の表を特定の項目（IDなど）で繋げることで、複雑な情報もスッキリ扱えるんやね。\n身近な例で言うと、図書室の管理システム。「本リスト」と「借りた人リスト」をIDで紐づけて管理してるんやわ。\nバラバラの表が関係（リレーション）を持つから、リレーショナルデータベースって呼ぶんやね。\n試験では「データを表形式で管理する」という特徴と、最も普及している方式やってことを覚えておいて！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["RDB", "テーブル", "SQL", "整理整頓"]
  },
  {
    "id": 26,
    "term": "主キー（プライマリキー）",
    "meaning": "データベースの表の中で、データを一意（唯一）に特定するための項目",
    "detail": "その項目を見れば、どのデータのことか絶対に間違いなく判別できる「背番号」みたいなもんやね。\n同じ値が二つあったり、中身が空っぽ（NULL）やったりすることは絶対に許されへんルールがあるんやわ。\n身近な例やと、学校の「出席番号」や「マイナンバー」がこれに当たるね。同姓同名がいても番号で区別できるやろ？\nこれが決まっているからこそ、膨大なデータの中から一瞬で目的の情報を見つけ出せるんやで。\n試験では「重複してはいけない」「空であってはいけない」という2つのルールが超頻出やから要注意！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["一意性", "インデックス", "レコード", "主キー"]
  },
  {
    "id": 27,
    "term": "SQL",
    "meaning": "データベースに対して、データの検索や操作を行うための専用言語",
    "detail": "データベースに「このデータを探して！」とか「新しいデータを追加して！」とお願いするための言葉やね。\n世界共通のルールやから、これさえ覚えれば色んな会社のシステムを操れるようになるんやわ。\n例えるなら、レストランで「Aランチ、ライス大盛りで」と注文する「注文票」みたいなもんやな。\nプログラミング言語とはまた違った、データベース専用の「魔法の呪文」やと思えばええよ。\n試験では、SELECT（選ぶ）、INSERT（入れる）、UPDATE（更新する）といった代表的な命令語の名前を知っておいてな！",
    "categoryId": "TECHNOLOGY.DATABASE",
    "tags": ["データベース言語", "検索", "操作", "リレーショナルデータベース"]
  },
  {
    "id": 28,
    "term": "プロトコル",
    "meaning": "ネットワークを通じてデータをやり取りするための「共通の約束事」",
    "detail": "コンピュータ同士が通信するとき、言葉が通じないと困るから、あらかじめ決めておくルールのことやね。\nデータの送り方や、エラーが起きたときの対処法などが細かく決まってるんやわ。\n身近な例で言うと、私たちが電話で「もしもし」と言ってから話し始める、あのマナーみたいなもんやね。\nインターネットで使われる「TCP/IP」や、Webサイトを見るための「HTTP」がその代表格やわ。\n試験では「異なるメーカーの機器同士でも、プロトコルさえ合えば通信できる」という点をしっかり押さえといてな！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["通信規約", "TCP/IP", "HTTP", "標準化"]
  },
  {
    "id": 29,
    "term": "IPアドレス",
    "meaning": "ネットワーク上のコンピュータを識別するための「住所」",
    "detail": "インターネットに繋がっている世界中の機器に割り振られた、重複のない番号のことやね。\nこれがあるからこそ、迷子にならずに目的の相手にデータを届けることができるんやわ。\n身近な例やと、家のポストにある「住所」や、スマホの「電話番号」と同じ役割やと思えばええよ。\n今は主流の「IPv4」に加えて、番号が足りなくなったから作られた「IPv6」という新しい規格も普及してるんやわ。\n試験では「ネットワーク上の住所」という言葉と、IPv4とIPv6の違いがよく問われるから要注意やで！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["IPv4", "IPv6", "住所", "インターネットプロトコル"]
  },
  {
    "id": 30,
    "term": "LANとWAN",
    "meaning": "繋がっているネットワークの「広さ」を表す区別",
    "detail": "家や学校といった限られた範囲内のネットワークをLAN、都市や国を越えて広く繋がるものをWANと呼ぶんやわ。\nLAN同士を通信事業者の回線を使って繋げたものが、大きなWANになるイメージやね。\n身近な例で言うと、家のWi-Fiに繋がってる状態が「LAN」で、一歩外に出て4Gや5Gでネットに繋ぐのが「WAN」を経由してることになるわ。\nちなみに、世界最大のWANこそが「インターネット」そのものなんやで。\n試験では、狭い範囲がLAN（Local）、広い範囲がWAN（Wide）という単語の意味の差を明確にしておいてな！",
    "categoryId": "TECHNOLOGY.NETWORK",
    "tags": ["LAN", "WAN", "Wi-Fi", "インターネット"]
  }
]